import { NextResponse } from 'next/server';

const singleChoice: Question[] = [
    {
      "id": 1,
      "type": "single",
      "question": "把习近平新时代中国特色社会主义思想确立为党的指导思想的会议是()",
      "options": ["党的十六大", "党的十七大", "党的十八大", "党的十九大"],
      "answer": "D"
    },
    {
      "id": 2,
      "type": "single",
      "question": "马克思主义中国化的最新理论成果是()",
      "options": [
        "毛泽东思想",
        "三民主义",
        "习近平新时代中国特色社会主义思想",
        "中国特色社会主义理论体系"
      ],
      "answer": "C"
    },
    {
      "id": 3,
      "type": "single",
      "question": "()是我们的强国之路。",
      "options": ["坚持改革开放", "坚持独立自主", "坚持科学发展", "坚持人民民主"],
      "answer": "A"
    },
    {
      "id": 4,
      "type": "single",
      "question": "习近平新时代中国特色社会主义思想内涵中最重要、最核心的内容是()",
      "options": ["四个明确", "五位一体", "十个明确", "十四个坚持"],
      "answer": "C"
    },
    {
      "id": 5,
      "type": "single",
      "question": "党的二十大报告指出我国社会主义建设的根本任务是()。",
      "options": [
        "实现中华民族的伟大复兴",
        "进一步解放生产力，发展生产力，逐步实现社会主义现代化，并且为此而改革生产关系和上层建筑中不适应生产力发展的方面和环节",
        "消灭剥削，消除两极分化",
        "实现共同富裕"
      ],
      "answer": "B"
    },
    {
      "id": 6,
      "type": "single",
      "question": "中国共产党在领导社会主义事业中，必须坚持以()为中心，其他各项工作必须服从和服务于这个中心。",
      "options": ["人民", "政治", "经济", "文化"],
      "answer": "C"
    },
    {
      "id": 7,
      "type": "single",
      "question": "党的二十大提出，坚持新时代党的组织路线。全面贯彻习近平新时代中国特色社会主义思想，要以()为重点，着力培养忠诚干净担当的高素质干部，着力积聚爱国奉献的各方面优秀人才。",
      "options": ["组织制度", "组织架构", "组织体系", "组织文化"],
      "answer": "C"
    },
    {
      "id": 8,
      "type": "single",
      "question": "2013年5月2日，习近平总书记给北京大学学生回信勉励当代青年指出()",
      "options": [
        "只有把人生理想融入国家和民族的事业中，才能最终成就一番事业",
        "有信念、有梦想、有奋斗、有奉献的人生，才是有意义的人生",
        "心中有阳光，脚下有力量，为了理想能坚持、不懈怠，才能创造无愧于时代的人生",
        "青年时期多经历一点摔打、挫折、考验，有利于走好一生的路"
      ],
      "answer": "A"
    },
    {
      "id": 9,
      "type": "single",
      "question": "党的二十大提出我国的社会主义建设，必须从我国的国情出发，走中国特色社会主义道路，以中国式现代化全面推进中华民族伟大复兴。在现阶段，我国社会的主要矛盾是()。",
      "options": [
        "阶级矛盾",
        "落后的农业和先进的工业国的矛盾",
        "人民日益增长的物质文化需要和落后的社会生产力之间的矛盾",
        "人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾"
      ],
      "answer": "D"
    },
    {
      "id": 10,
      "type": "single",
      "question": "经过长期努力，中国特色社会主义进入了新时代，这是我国发展新的()。",
      "options": ["未来方向", "未来方位", "历史方向", "历史方位"],
      "answer": "D"
    },
    {
      "id": 11,
      "type": "single",
      "question": "制定党的路线方针政策的基本依据是()",
      "options": [
        "对中国社会主要矛盾的科学判断",
        "明确社会主义核心价值体系",
        "坚持中国特色社会主义道路",
        "对党的根本宗旨的科学判断"
      ],
      "answer": "A"
    },
    {
      "id": 12,
      "type": "single",
      "question": "()是关系党的事业兴衰成败第一位的问题。",
      "options": ["理论问题", "制度问题", "道路问题", "文化问题"],
      "answer": "C"
    },
    {
      "id": 13,
      "type": "single",
      "question": "坚定道路自信，就是坚信中国特色社会主义道路自信是我国实现社会主义现代化、创造人民美好生活的()。",
      "options": ["理论之基", "制度保障", "必由之路", "力量之源"],
      "answer": "C"
    },
    {
      "id": 14,
      "type": "single",
      "question": "()是我国发展新的历史方位，标志着中国特色社会主义事业进入了新的发展阶段。",
      "options": ["新阶段", "新时代", "新过程", "新领域"],
      "answer": "B"
    },
    {
      "id": 15,
      "type": "single",
      "question": "党的()是坚持和发展中国特色社会主义的行动指南。",
      "options": ["基本理论", "基本经验", "基本路线", "基本方略"],
      "answer": "A"
    },
    {
      "id": 16,
      "type": "single",
      "question": "党的()是国家的生命线、人民的幸福线。",
      "options": ["基本理论", "基本经验", "基本路线", "基本方略"],
      "answer": "C"
    },
    {
      "id": 18,
      "type": "single",
      "question": "党的()首次提出以人民为中心的发展思想",
      "options": ["十八届五中全会", "十八大", "十九大", "十八届三中全会"],
      "answer": "A"
    },
    {
      "id": 19,
      "type": "single",
      "question": "党的()把生态文明建设纳入中国特色社会主义事业“五位一体”总体布局。",
      "options": ["十七大", "十八大", "十九大", "十六大"],
      "answer": "B"
    },
    {
      "id": 20,
      "type": "single",
      "question": "一个国家、一个民族发展中更基本、更深沉、更持久的力量是()",
      "options": ["道路自信", "理论自信", "制度自信", "文化自信"],
      "answer": "D"
    },
    {
      "id": 21,
      "type": "single",
      "question": "习近平新时代中国特色社会主义思想的核心要义是()",
      "options": [
        "协调推进“四个全面”战略布局",
        "坚持党对一切工作的领导",
        "统筹推进“五位一体”总体布局",
        "坚持和发展中国特色社会主义"
      ],
      "answer": "D"
    },
    {
      "id": 22,
      "type": "single",
      "question": "党的十九大报告指出，在本世纪中叶，分两步走建成()的社会主义现代化强国。",
      "options": [
        "富强、民主、文明、开放、进步",
        "富强、民主、文明、和谐、现代",
        "富强、民主、文明、和谐、美丽",
        "富强、民主、开放、和谐、进步"
      ],
      "answer": "C"
    },
    {
      "id": 23,
      "type": "single",
      "question": "()是我们的强国之路。",
      "options": ["坚持改革开放", "坚持独立自主", "坚持科学发展", "坚持人民民主"],
      "answer": "A"
    },
    {
      "id": 24,
      "type": "single",
      "question": "()是近代以来中国人民的共同梦想，是中国共产党矢志不渝的奋斗目标。",
      "options": [
        "实现中华民族的伟大复兴",
        "全面建成小康社会",
        "全面加强领导",
        "实现向发达国家的飞跃"
      ],
      "answer": "A"
    },
    {
      "id": 25,
      "type": "single",
      "question": "习近平总书记指出：“一百年来，中国共产党团结带领中国人民进行的一切奋斗、一切牺牲、一切创造，归结起来就一个主题：()”。",
      "options": [
        "实现共同富裕",
        "实现小康社会建设目标",
        "实现中华民族伟大复兴",
        "实现中华民族伟大历史飞跃"
      ],
      "answer": "C"
    },
    {
      "id": 26,
      "type": "single",
      "question": "我国提前()年，实现联合国2030年可持续发展议程减贫目标，创造了人类有史以来规模最大、持续时间最长、惠及人口最多的减贫奇迹，为人类摆脱贫困，走向现代化提供了中国智慧和中国方案。",
      "options": ["10", "11", "12D15"],
      "answer": "A"
    },
    {
      "id": 27,
      "type": "single",
      "question": "推进中国式现代化需要正确处理多重重大关系，其中处理好自立自强与对外开放的关系，()是中国的基本国策，任何时候都不能动摇。",
      "options": ["独立自主", "改革开放", "团结奋斗", "公平正义"],
      "answer": "B"
    },
    {
      "id": 28,
      "type": "single",
      "question": "中国式现代化打破了()的迷思，展现了不同于西方化的新图景。",
      "options": [
        "现代化=资本化",
        "现代化=西方化",
        "现代化=金钱化",
        "现代化=规模化"
      ],
      "answer": "B"
    },
    {
      "id": 29,
      "type": "single",
      "question": "推进中国式现代化需要牢牢把握重大原则，全面建设社会主义现代化国家、全面推进中华民族伟大复兴，动力在于()。",
      "options": [
        "坚持以人民为中心",
        "坚持深化改革开放",
        "坚持守正创新",
        "坚持发扬斗争精神"
      ],
      "answer": "B"
    },
    {
      "id": 30,
      "type": "single",
      "question": "党的领导直接关系中国式现代化的根本方向、前途命运、最终成败。党的领导决定中国式现代化的根本性质，党的()决定了中国式现代化是社会主义现代化而不是别的什么现代化。",
      "options": [
        "性质宗旨、初心使命、信仰信念、政策主张",
        "性质宗旨、强劲机制、信仰信念、政策主张",
        "性质宗旨、初心使命、体制机制、政策主张",
        "性质宗旨、初心使命、信仰信念、战略策略"
      ],
      "answer": "A"
    },
    {
      "id": 31,
      "type": "single",
      "question": "中国特色社会主义最本质的特征和中国特色社会主义制度的最大优势是()",
      "options": [
        "民主集中制",
        "密切联系群众",
        "中国共产党的领导",
        "社会主义民主协商"
      ],
      "answer": "C"
    },
    {
      "id": 32,
      "type": "single",
      "question": "()直接关系中国式现代化的根本方向、前途命运、最终成败。",
      "options": ["人民为中心", "一切为了人民", "党的领导", "坚持社会主义制度"],
      "answer": "C"
    },
    {
      "id": 33,
      "type": "single",
      "question": "中国式现代化是造福人民的现代化，()是推进现代化最坚实的根基、最深厚的力量。",
      "options": ["人民", "国家", "社会", "制度"],
      "answer": "A"
    },
    {
      "id": 34,
      "type": "single",
      "question": "推进中国式现代化需要正确处理多重重大关系，其中处理好自立自强与对外开放的关系，()是中华民族精神之魂，是我们立党立国的重要原则。",
      "options": ["独立自主", "守正创新", "团结奋斗", "公平正义"],
      "answer": "A"
    },
    {
      "id": 35,
      "type": "single",
      "question": "全面建成社会主义现代化强国的战略安排，把基本实现社会主义现代化的时间提前了()年，提出了全面建设社会主义现代化国家、全面推进中华民族伟大复兴的更高目标，明确了全面建成社会主义现代化强国的时间表。",
      "options": ["10", "11", "12", "15"],
      "answer": "D"
    },
    {
      "id": 36,
      "type": "single",
      "question": "坚持党的全面领导是坚持和发展中国特色社会主义的()。",
      "options": ["必由之路", "坚强核心", "必然保障", "力量之源"],
      "answer": "A"
    },
    {
      "id": 37,
      "type": "single",
      "question": "习近平同志指出，“中国特色社会主义最本质的特征是中国共产党的领导，中国特色社会主义最大的政治优势是中国共产党领导，中国共产党是最高政治力量，坚持党中央集中统一领导是最高()”。",
      "options": ["组织原则", "制度原则", "领导原则", "政治原则"],
      "answer": "D"
    },
    {
      "id": 38,
      "type": "single",
      "question": "中国特色社会主义有很多特点和特征，其中最本质的特征是中国共产党的领导。这个最本质特征是在近代中国历史发展中形成的，是由()决定的。",
      "options": [
        "中国最广大人民根本利益和实现中华民族伟大复兴历史任务",
        "解决人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾",
        "全体中华儿女勠力同心、奋力实现中华民族伟大复兴中国梦的任务",
        "决胜全面建成小康社会，进而全面建设社会主义现代化强国的时代要求"
      ],
      "answer": "A"
    },
    {
      "id": 39,
      "type": "single",
      "question": "中国共产党的领导是中国特色社会主义事业的坚强领导核心。习近平总书记指出：“一定要认清，中国最大的国情就是()。”",
      "options": [
        "社会主义初级阶段",
        "发展中国家",
        "中国共产党领导",
        "社会主义社会"
      ],
      "answer": "C"
    },
    {
      "id": 40,
      "type": "single",
      "question": "习近平总书记指出：“实践证明，马克思主义是我们认识世界、把握规律、追求真理、改造世界的强大思想武器，是我们党和国家必须始终遵循的()。”",
      "options": ["理论基础", "科学武器", "指导思想", "价值目标"],
      "answer": "C"
    },
    {
      "id": 41,
      "type": "single",
      "question": "要坚持和加强党的领导制度，使党的政治领导力、思想引领力、群众组织力、社会号召力显著增强。其中()是马克思主义政党第一位的能力。",
      "options": ["政治领导力", "思想引领力", "群众组织力", "社会号召力"],
      "answer": "A"
    },
    {
      "id": 42,
      "type": "single",
      "question": "事在四方，要在中央。()是党的领导的最高原则，是党保持团结统一和强大战斗力、不断取得胜利的关键所在。",
      "options": ["党中央集中统一领导", "统一战线", "民主集中制", "以人民为中心"],
      "answer": "A"
    },
    {
      "id": 43,
      "type": "single",
      "question": "中国共产党是以()为根本组织原则和领导制度的马克思主义政党。",
      "options": ["民主集中制", "少数服从多数", "全心全意为人民服务", "独立自主"],
      "answer": "A"
    },
    {
      "id": 44,
      "type": "single",
      "question": "坚持党对一切工作的领导，要统筹推进_____总体布局，协调推进______战略布局()",
      "options": [
        "“五位一体”“四个全面”",
        "“四位一体”“四个全面”",
        "“五位一体”“五个全面”",
        "“三位一体”“四个全面”"
      ],
      "answer": "A"
    },
    {
      "id": 45,
      "type": "single",
      "question": "党作为最高政治力量在治国理政中的重要体现是()",
      "options": [
        "坚持和完善党的领导体制机制",
        "确保党始终总揽全局协调各方",
        "坚持党的民主集中制原则",
        "增强政治意识、大局意识、核心意识、看齐意识"
      ],
      "answer": "B"
    },
    {
      "id": 46,
      "type": "single",
      "question": "我们党区别于其他任何政党的一个显著标志是()",
      "options": ["实事求是", "密切联系群众", "独立自主", "与时俱进"],
      "answer": "B"
    },
    {
      "id": 47,
      "type": "single",
      "question": "既是中国工人阶级、中国人民和中华民族的先锋队，又是中国特色社会主义事业领导核心的是()",
      "options": ["中国共产党", "农民阶级", "知识分子", "人民群众"],
      "answer": "A"
    },
    {
      "id": 48,
      "type": "single",
      "question": "坚持以人民为中心的根本立场，必须把()贯彻到治国理政全部活动之中。",
      "options": ["群众路线", "实事求是", "解放思想", "人民路线"],
      "answer": "A"
    },
    {
      "id": 49,
      "type": "single",
      "question": "()是中国共产党的根本政治立场，是马克思主义政党区别于其他政党的显著标志。",
      "options": ["群众立场", "人民立场", "阶级立场", "唯物主义立场‘’"],
      "answer": "B"
    },
    {
      "id": 50,
      "type": "single",
      "question": "()是我们党的根本宗旨。",
      "options": [
        "促进居民收入增长",
        "发展经济",
        "促进基本公共服务均等化",
        "全心全意为人民服务"
      ],
      "answer": "D"
    },
    {
      "id": 51,
      "type": "single",
      "question": "()是社会主义的本质要求，是中国式现代化的重要特征。",
      "options": ["公有制为主体", "多种所有制并存", "共同富裕", "共同发展"],
      "answer": "C"
    },
    {
      "id": 52,
      "type": "single",
      "question": "()是历史的创造者，是决定党和国家前途命运的根本力量。",
      "options": ["工人阶级", "农民阶级", "群众", "人民"],
      "answer": "D"
    },
    {
      "id": 53,
      "type": "single",
      "question": "中国共产党人的初心和使命是()。",
      "options": [
        "为中国人民谋幸福，为中华民族谋复兴",
        "夺取全国政权，建立新中国",
        "为工人阶级谋幸福，为人类谋大同",
        "实现共产主义远大理想"
      ],
      "answer": "A"
    },
    {
      "id": 54,
      "type": "single",
      "question": "以人民为中心的发展思想，绝对不能只停留在口头上，要全方位贯穿于经济社会发展的各个环节，体现在人民群众()的扎实提升上。",
      "options": [
        "幸福感、获得感、使命感",
        "获得感、幸福感、安全感",
        "满足感、幸福感、安全感",
        "安全感、幸福感、使命感"
      ],
      "answer": "B"
    },
    {
      "id": 55,
      "type": "single",
      "question": "党的十九大报告把()列入习近平新时代中国特色社会主义思想的重要内容",
      "options": [
        "不断促进人的全面发展",
        "不断促进人的生活水平提高",
        "不断提高人对美好生活的向往",
        "不断促进人的自由发展"
      ],
      "answer": "A"
    },
    {
      "id": 56,
      "type": "single",
      "question": "()指出，社会主义最大的优越性就是共同富裕，这是体现社会主义本质的一个东西。",
      "options": ["毛泽东", "江泽民", "习近平", "邓小平"],
      "answer": "D"
    },
    {
      "id": 57,
      "type": "single",
      "question": "关于共同富裕，以下判断正确的是()",
      "options": [
        "到2050年，基本公共服务实现均等化",
        "到2035年，全体人民共同富裕基本实现",
        "到2035年，全体人民共同富裕取得更为明显的实质性进展",
        "到2035年，居民收入和实际消费水平差距缩小到合理区间"
      ],
      "answer": "C"
    },
    {
      "id": 58,
      "type": "single",
      "question": "实现共同富裕，必须立足社会主义初级阶段，坚持“两个毫不动摇”，即()",
      "options": [
        "毫不动摇地巩固和发展公有制经济，毫不动摇地鼓励、支持、引导非公有制经济发展",
        "毫不动摇地鼓励和支持公有制经济，毫不动摇地巩固、发展、引导非公有制经济发展",
        "毫不动摇地坚持和发展公有制经济，毫不动摇地巩固、发展、引导非公有制经济发展",
        "毫不动摇地支持公有制经济，毫不动摇地鼓励、巩固、监督非公有制经济发展"
      ],
      "answer": "A"
    },
    {
      "id": 59,
      "type": "single",
      "question": "实现共同富裕，必须要建立科学的公共政策体系，把蛋糕分好，形成人人享有的合理分配格局，要以更大的力度、更实的举措让人民群众有更多()",
      "options": ["安全感", "获得感", "幸福感", "满足感"],
      "answer": "B"
    },
    {
      "id": 60,
      "type": "single",
      "question": "坚持以人民为中心的发展思想，就必须做到把()作为发展的出发点和落脚点",
      "options": [
        "发展人民民主，维护社会公平正义",
        "增进人民福祉、促进人的全面发展",
        "保障人民平等参与、平等发展权利",
        "充分调动人民积极性、主动性、创造性"
      ],
      "answer": "B"
    },
    {
      "id": 61,
      "type": "single",
      "question": "()是决定当代中国命运和实现中华民族伟大复兴的关键一招。",
      "options": ["对内搞活", "改革开放", "深化改革", "对外开放"],
      "answer": "B"
    },
    {
      "id": 62,
      "type": "single",
      "question": "当前，国内外环境都在发生极为广泛而深刻的变化，我国发展面临一系列突出矛盾和挑战，前进道路上还有不少困难和问题。解决这些问题，关键在于()",
      "options": ["全面深化改革", "改革开放", "全面深化改革开放", "全面扩大开放"],
      "answer": "C"
    },
    {
      "id": 63,
      "type": "single",
      "question": "党的十八届三中全会提出，全面深化改革的总目标是()",
      "options": [
        "完善和发展中国特色社会主义制度，推进国家治理体系和治理能力现代化",
        "完善和发展中国特色社会主义制度，推进社会治理体系和治理能力现代化",
        "完善和发展人民当家作主制度体系，推进治理体系和治理能力现代化",
        "完善和发展党的领导制度体系，推进国家治理体系和治理能力现代化"
      ],
      "answer": "A"
    },
    {
      "id": 64,
      "type": "single",
      "question": "全面深化改革的核心问题是处理好()",
      "options": [
        "顶层设计和摸着石头过河的关系",
        "公有制经济和非公有制经济的关系",
        "解放思想和实事求是的关系",
        "政府和市场的关系"
      ],
      "answer": "D"
    },
    {
      "id": 65,
      "type": "single",
      "question": "全面深化改革必须以促进社会()、增进人民福祉为出发点和落脚点。",
      "options": ["自由平等", "公平正义", "文明和谐", "民主法治"],
      "answer": "B"
    },
    {
      "id": 66,
      "type": "single",
      "question": "我国要继续朝着加快完善社会主义市场经济体制的目标努力，着力健全使市场在资源配置中起()和更好发挥政府作用的制度体系。",
      "options": ["辅助性作用", "决定性作用", "重要性作用", "突出性作用"],
      "answer": "B"
    },
    {
      "id": 67,
      "type": "single",
      "question": "中国特色社会主义制度是一个严密完整的科学制度体系，起四梁八柱作用的是根本制度、基本制度、重要制度，其中具有统领地位的是()",
      "options": [
        "党的领导制度",
        "人民代表大会制度",
        "中国共产党领导的多党合作和政治协商制度",
        "马克思主义在意识形态领域指导地位的制度"
      ],
      "answer": "A"
    },
    {
      "id": 68,
      "type": "single",
      "question": "我们统筹国内国际两个大局，坚持对外开放的基本国策，实行积极主动的开放政策，形成()的全面开放新格局",
      "options": [
        "全方向、多层次、宽领域",
        "全方位、多层次、宽领域",
        "全方位、多层次，宽口径",
        "多方向、全层次、宽领域"
      ],
      "answer": "B"
    },
    {
      "id": 69,
      "type": "single",
      "question": "十八届三中全会通过的《中共中央关于全面深化改革若干重大问题的决定》提出“()是全面深化改革的重点”。",
      "options": ["政治体制改革", "社会体制改革", "经济体制改革", "文化体制改革"],
      "answer": "C"
    },
    {
      "id": 70,
      "type": "single",
      "question": "“一带一路”倡议的努力方向是()",
      "options": [
        "构建全面开放新格局",
        "深化“五通”合作",
        "共商共建共享",
        "坚持引进来和走出去并重"
      ],
      "answer": "A"
    },
    {
      "id": 71,
      "type": "single",
      "question": "“一带一路”战略中的“一路”是指()",
      "options": [
        "海上丝绸之路经济带",
        "21世纪海上丝绸之路",
        "丝绸之路经济带",
        "21世纪丝绸之路"
      ],
      "answer": "B"
    },
    {
      "id": 72,
      "type": "single",
      "question": "“一带一路”战略中的“一带”是指()",
      "options": [
        "海上丝绸之路经济带",
        "21世纪海上丝绸之路",
        "丝绸之路经济带",
        "21世纪丝绸之路"
      ],
      "answer": "C"
    },
    {
      "id": 73,
      "type": "single",
      "question": "关于国家治理体系，以下判断正确的是()",
      "options": [
        "国家治理体系是在党领导下管理国家的制度体系，包括经济、政治、文化三方面的体制机制和法律法规安排",
        "国家治理体系是在党领导下管理国家的制度体系，包括经济、政治、文化、社会四方面的体制机制和法律法规安排",
        "国家治理体系是在党领导下管理国家的制度体系，包括经济、政治、文化、社会、生态五方面的体制机制和法律法规安排",
        "国家治理体系是在党领导下管理国家的制度体系，包括经济、政治、文化、社会、生态、党的建设六方面的体制机制和法律法规安排"
      ],
      "answer": "D"
    },
    {
      "id": 74,
      "type": "single",
      "question": "新发展阶段就是我国全面建设社会主义现代化国家、向()进军的阶段",
      "options": [
        "第二个百年奋斗目标",
        "第一个百年奋斗目标",
        "全面建成小康社会",
        "全面建设小康社会"
      ],
      "answer": "A"
    },
    {
      "id": 75,
      "type": "single",
      "question": "在五大新发展理念中，既是发展手段，也是发展目标，还是发展的评价标准和尺度的是()发展。",
      "options": ["创新", "协调", "绿色", "开放"],
      "answer": "B"
    },
    {
      "id": 76,
      "type": "single",
      "question": "中国经济“新常态”不具有的特征是()。",
      "options": [
        "第三产业占比下降",
        "从高速增长转为中高速增长",
        "经济结构不断优化升级",
        "从要素驱动、投资驱动转向创新驱动"
      ],
      "answer": "A"
    },
    {
      "id": 77,
      "type": "single",
      "question": "推进供给侧结构性改革是适应我国经济发展新常态的重大决策，其根本目的是()。",
      "options": [
        "加快政府职能转变",
        "提高供给质量满足需求",
        "推进“去产能、去库存、去杠杆”",
        "深化价格、财税、金融、社保等领域基础性改革"
      ],
      "answer": "B"
    },
    {
      "id": 78,
      "type": "single",
      "question": "供给侧结构性改革的主要任务包括三去一降一补，其中“一降”是指：()。",
      "options": ["降税率", "降产能", "降消耗", "降成本"],
      "answer": "D"
    },
    {
      "id": 79,
      "type": "single",
      "question": "对于我国现阶段的国民经济而言，跨越关口的迫切要求和我国发展的战略目标是()。",
      "options": [
        "深化要素市场化配置改革",
        "建设现代化经济体系",
        "供给侧结构性改革",
        "实施创新驱动发展战略"
      ],
      "answer": "B"
    },
    {
      "id": 80,
      "type": "single",
      "question": "我国建设的现代化经济体系不包含()",
      "options": [
        "创新引领的产业体系",
        "统一开放的市场体系",
        "彰显优势的城乡区域发展体系",
        "效率优先的收入分配体系"
      ],
      "answer": "D"
    },
    {
      "id": 81,
      "type": "single",
      "question": "引领发展的第一动力是()",
      "options": ["创新", "协调", "绿色", "共享"],
      "answer": "A"
    },
    {
      "id": 82,
      "type": "single",
      "question": "关于我国建设的创新型国家，判断错误的是()",
      "options": [
        "技术创新体系的主体是政府",
        "到2020年我国进入创新型国家行列",
        "到2035年左右我国进入创新型国家前列",
        "到2050年我国成为世界科技强国"
      ],
      "answer": "A"
    },
    {
      "id": 83,
      "type": "single",
      "question": "我国实行的是社会主义市场经济体制，构建高水平社会主义市场经济体制的核心问题是处理好()的关系。",
      "options": ["计划和市场", "改革和开放", "政府和市场", "公平和效率"],
      "answer": "C"
    },
    {
      "id": 84,
      "type": "single",
      "question": "()是一国经济的立身之本，是现代化经济体系的坚实基础。",
      "options": ["制造业", "实体经济", "虚拟经济", "第三产业"],
      "answer": "B"
    },
    {
      "id": 85,
      "type": "single",
      "question": "建设现代化经济体系，要求我们建设()的收入分配体系。",
      "options": [
        "体现效率、促进公平",
        "效率优先、兼顾公平",
        "公平优先、效率次之",
        "公平优先、提高效率"
      ],
      "answer": "A"
    },
    {
      "id": 86,
      "type": "single",
      "question": "五大新发展理念中，()发展理念注重解决发展的内外联动问题。",
      "options": ["创新", "开放", "协调", "绿色"],
      "answer": "B"
    },
    {
      "id": 87,
      "type": "single",
      "question": "当前，加快构建以()为主体、国内国际双循环相互促进的新发展格局，是把握未来发展主动权的战略性布局和先手棋，是新发展阶段要着力推动完成的重大历史任务。",
      "options": ["国内大循环", "国内国际双循环", "国际大循环", "国内大市场"],
      "answer": "A"
    },
    {
      "id": 88,
      "type": "single",
      "question": "教育、科技、人才是全面建设社会主义现代化的基础性、战略性支撑。其中()是实现民族振兴、赢得国际竞争主动的战略资源。",
      "options": ["教育", "科技", "人才", "技术"],
      "answer": "C"
    },
    {
      "id": 89,
      "type": "single",
      "question": "全面建设社会主义现代化国家，()是根本。",
      "options": ["教育", "科技", "人才", "技术"],
      "answer": "A"
    },
    {
      "id": 90,
      "type": "single",
      "question": "全面建设社会主义现代化国家，()是关键。",
      "options": ["教育", "科技", "人才", "技术"],
      "answer": "B"
    },
    {
      "id": 91,
      "type": "single",
      "question": "全面建设社会主义现代化国家，()是第一动力。",
      "options": ["教育", "科技", "人才", "创新"],
      "answer": "D"
    },
    {
      "id": 92,
      "type": "single",
      "question": "加快建设教育强国，必须把教育事业放在优先发展的战略位置，把()作为教育的根本任务。",
      "options": ["立德树人", "改革创新", "守正创新", "自立自强"],
      "answer": "A"
    },
    {
      "id": 93,
      "type": "single",
      "question": "办好中国特色社会主义教育，必须坚持()对教育工作的全面领导，坚持党的教育方针，坚持社会主义的办学方向。",
      "options": ["国家", "党", "政府", "组织"],
      "answer": "B"
    },
    {
      "id": 94,
      "type": "single",
      "question": "()是发展教育的根本尺度。",
      "options": ["人民满意", "社会满意", "国家满意", "世界满意"],
      "answer": "A"
    },
    {
      "id": 95,
      "type": "single",
      "question": "()是各级各类教育的生命线。",
      "options": ["高质量", "高速度", "高水平", "高效率"],
      "answer": "A"
    },
    {
      "id": 96,
      "type": "single",
      "question": "全面建设社会主义现代化国家、全面推进中华民族伟大复兴，我们对教育、科技、人才的需要比以往任何时候都更加迫切、更加强烈。党的二十大作出()的战略安排，既是对教育、科技发展规律的科学运用，又是立足中国发展方位作出的战略抉择，充分体现了习近平新时代中国特色社会主义思想的系统思维。",
      "options": [
        "“实施人才强国战略，强化现代化建设人才支撑”",
        "“实施经济发展战略，强化现代化建设经济支撑”",
        "“实施科技强国战略，强化现代化建设技术支撑”",
        "“实施科教兴国战略，强化现代化建设人才支撑”"
      ],
      "answer": "D"
    },
    {
      "id": 97,
      "type": "single",
      "question": "()是百年未有之大变局中的一个关键变量，世界主要国家纷纷把科技创新作为国际战略博弈的主要战场，围绕科技制高点的竞争空前激烈，谁牵住了科技创新这个“牛鼻子”，谁走好了科技创新这步先手棋，谁就能占领先机、赢得优势。",
      "options": ["人才支撑", "科技创新", "技术发展", "文化创新"],
      "answer": "B"
    },
    {
      "id": 98,
      "type": "single",
      "question": "我们坚持发展是第一要务、创新是第一动力、人才是第一资源，确立人才引领发展的战略地位，发挥重大人才工程牵引作用，因此()是国家和民族长远发展大计。",
      "options": ["发展", "科技", "人才", "教育"],
      "answer": "C"
    },
    {
      "id": 99,
      "type": "single",
      "question": "()是我国的根本政治制度。",
      "options": [
        "人民代表大会制度",
        "政治协商制度",
        "民族区域自治制度",
        "基层群众自治制度"
      ],
      "answer": "A"
    },
    {
      "id": 100,
      "type": "single",
      "question": "社会主义民主最广泛的实践是()。",
      "options": ["企业职工代表大会", "基层民主", "政治协商", "人民代表大会"],
      "answer": "B"
    },
    {
      "id": 101,
      "type": "single",
      "question": "我国人民行使国家权力的机关是()",
      "options": [
        "国务院",
        "最高人民法院",
        "最高人民检察院",
        "全国人民代表大会和地方各级人民代表大会"
      ],
      "answer": "D"
    },
    {
      "id": 102,
      "type": "single",
      "question": "社会主义的生命是()",
      "options": ["党的领导", "人民民主", "群众路线", "社会主义政治制度"],
      "answer": "B"
    },
    {
      "id": 103,
      "type": "single",
      "question": "坚持和完善基层群众自治制度，要把()贯穿基层群众自治全过程和各方面。",
      "options": ["民主协商", "民主参与", "民主监督", "党的领导"],
      "answer": "D"
    },
    {
      "id": 104,
      "type": "single",
      "question": "()集中体现了我国人民民主的本质属性，是保证当家作主科学有效的制度安排。",
      "options": [
        "党的领导",
        "中国特色社会主义政治制度",
        "基层民主制度",
        "人民代表大会制度"
      ],
      "answer": "B"
    },
    {
      "id": 105,
      "type": "single",
      "question": "()是中国社会主义民主政治中独特的、独有的、独到的民主形式。",
      "options": ["基层民主", "民主制度", "协商民主", "政协制度"],
      "answer": "C"
    },
    {
      "id": 106,
      "type": "single",
      "question": "全国人民代表大会和地方各级人民代表大会的议事原则是()",
      "options": ["下级服从上级", "少数服从多数", "民主集中制", "委员长负责制"],
      "answer": "C"
    },
    {
      "id": 107,
      "type": "single",
      "question": "县、自治县、不设区的市、市辖区、乡、民族乡、镇的人大代表由()选举产生。",
      "options": [
        "下一级的人民代表大会",
        "本级的人民代表大会",
        "村民委员会、居民委员会",
        "选民直接"
      ],
      "answer": "D"
    },
    {
      "id": 108,
      "type": "single",
      "question": "全国人大代表、省、自治区、直辖市、设区的市、自治州的人大代表，由()选举产生。",
      "options": [
        "下一级的人民代表大会",
        "本级的人民代表大会",
        "村民委员会、居民委员会",
        "选民直接"
      ],
      "answer": "A"
    },
    {
      "id": 109,
      "type": "single",
      "question": "()是中国发展全过程人民民主的根本保证。",
      "options": [
        "中国特色社会主义民主制度",
        "依法治国",
        "中国共产党的领导",
        "坚持社会主义民主政治"
      ],
      "answer": "C"
    },
    {
      "id": 110,
      "type": "single",
      "question": "()是社会主义民主政治的本质特征。",
      "options": ["人民民主", "人民当家作主", "中国共产党的领导", "依法治国"],
      "answer": "B"
    },
    {
      "id": 111,
      "type": "single",
      "question": "()是中国共产党夺取革命、建设、改革事业胜利的重要法宝，是实现中华民族伟大复兴的重要法宝。",
      "options": ["人民代表大会制度", "民主集中制", "政治协商制度", "统一战线"],
      "answer": "D"
    },
    {
      "id": 112,
      "type": "single",
      "question": "全过程人民民主好在哪里()",
      "options": [
        "直接民主和间接民主相统一",
        "全链条、全方位、全覆盖的民主",
        "最广泛、最真实、最管用的社会主义民主",
        "人民民主和国家意志相统一"
      ],
      "answer": "C"
    },
    {
      "id": 113,
      "type": "single",
      "question": "坚持()是统一战线最核心最根本的问题。",
      "options": ["求同存异", "党的领导", "群众路线", "原则纪律"],
      "answer": "B"
    },
    {
      "id": 114,
      "type": "single",
      "question": "习近平同志指出：“不是什么法都能治国，不是什么法都能治好国。”()是现代法治国家的重要标志，也是衡量现代社会文明进步的重要标尺。",
      "options": ["法律", "法规", "宪法", "法治"],
      "answer": "C"
    },
    {
      "id": 115,
      "type": "single",
      "question": "加快建设法治中国，必须适应全面建设社会主义现代化国家的要求。其中，()是维护社会公平正义的最后一道防线。",
      "options": ["依法行政", "公正司法", "行政执法", "公共法律服务"],
      "answer": "B"
    },
    {
      "id": 116,
      "type": "single",
      "question": "()解决了党和国家事业发展中的重大民生问题，为实现人民美好生活提供了坚实的法治保障。",
      "options": ["《民法典》", "《刑法》", "《宪法》", "《仲裁法》"],
      "answer": "A"
    },
    {
      "id": 117,
      "type": "single",
      "question": "党的十八届()提出全面推进依法治国总目标，通过了《中共中央关于全面推进依法治国若干重大问题的决定》。",
      "options": ["一中全会", "二中全会", "三中全会", "四中全会"],
      "answer": "D"
    },
    {
      "id": 118,
      "type": "single",
      "question": "党领导全面依法治国，习近平总书记强调这十六个字()，又被称为“新法治十六字方针”。",
      "options": [
        "科学立法、严格执法、公正司法、全民守法",
        "有法可依、有法必依、公正司法、全民守法",
        "有法可依、有法必依、执法必严、违法必究",
        "公正司法、全民守法、执法必严、违法必究"
      ],
      "answer": "A"
    },
    {
      "id": 119,
      "type": "single",
      "question": "()让管党治党更加“有规可依、有规必依”，为全面从严治党取得显著成效提供了坚实的制度保障。",
      "options": [
        "完备的法律规范体系",
        "高效的法治实施体系",
        "严密的法治监督体系",
        "有力的法治保障体系"
      ],
      "answer": "C"
    },
    {
      "id": 120,
      "type": "single",
      "question": "国内法治和()是法治中国建设的重要方面，要协调推进国内治理和国际治理，更好维护国家主权、安全、发展利益。",
      "options": ["国际治理", "涉外法治", "国际关系", "国际法治"],
      "answer": "B"
    },
    {
      "id": 121,
      "type": "single",
      "question": "()是实施法律法规的重要主体，要带头严格执法，维护公共利益、人民权益和社会秩序。",
      "options": ["立法机关", "党政机关", "司法机关", "行政机关"],
      "answer": "D"
    },
    {
      "id": 122,
      "type": "single",
      "question": "2020年，中共中央印发()，从全局和战略高度对法治中国建设作出系统部署，在党和国家法治建设史上具有重大意义。",
      "options": [
        "《宪法》",
        "《民法典》",
        "《中共中央关于全面推进依法治国若干重大问题的决定》",
        "《法治中国建设规划（2020-2025）》"
      ],
      "answer": "D"
    },
    {
      "id": 123,
      "type": "single",
      "question": "我国现行宪法是()年颁布实施的。",
      "options": ["1954", "1982", "1984", "1986"],
      "answer": "B"
    },
    {
      "id": 124,
      "type": "single",
      "question": "()是中国的国家宪法日。",
      "options": ["10月4日", "11月5日", "12月4日", "12月5日"],
      "answer": "C"
    },
    {
      "id": 125,
      "type": "single",
      "question": "《中共中央关于党的百年奋斗重大成就和历史经验的决议》指出，党坚持把()放在首位、社会效益和经济效益相统一，推进文化事业和文化产业全面发展，繁荣文艺创作，完善公共文化服务体系，为人民提供了更多更好的精神食粮。",
      "options": ["经济效益", "政治效益", "社会效益", "生态效益"],
      "answer": "C"
    },
    {
      "id": 126,
      "type": "single",
      "question": "我们要通过文艺作品发挥重要作用，以下不正确的是()。",
      "options": [
        "传递真善美",
        "传递向上向善的价值观",
        "引导人们增强道德判断力和道德荣誉感",
        "传递追求安逸的生活态度"
      ],
      "answer": "D"
    },
    {
      "id": 127,
      "type": "single",
      "question": "意识形态工作是党的一项()的工作。",
      "options": ["不值一提", "可有可无", "比较重要", "极端重要"],
      "answer": "D"
    },
    {
      "id": 128,
      "type": "single",
      "question": "()是实现中华民族伟大复兴的精神支撑。",
      "options": ["经济发展", "政治稳定", "文化繁荣", "社会和谐"],
      "answer": "C"
    },
    {
      "id": 129,
      "type": "single",
      "question": "社会主义核心价值观是()提出的？",
      "options": ["党的十六届六中全会", "党的十八大", "党的十九大", "党的二十大"],
      "answer": "B"
    },
    {
      "id": 130,
      "type": "single",
      "question": "建设社会主义文化强国、推动社会主义文化繁荣兴盛，关键在于()。",
      "options": [
        "雄厚的经济基础",
        "稳定的政治环境",
        "坚定中国特色社会主义文化自信",
        "和谐的社会环境"
      ],
      "answer": "C"
    },
    {
      "id": 131,
      "type": "single",
      "question": "()是推动社会主义文化繁荣兴盛的唯一正确道路。",
      "options": [
        "中国特色社会主义经济发展道路",
        "中国特色社会主义政治发展道路",
        "中国特色社会主义文化发展道路",
        "中国特色社会主义法治道路"
      ],
      "answer": "C"
    },
    {
      "id": 132,
      "type": "single",
      "question": "必须坚定文化自信，牢牢把握社会主义先进文化前进方向，坚持为人民服务、为社会主义服务，更好构筑中国精神、()、中国力量。",
      "options": ["中国文化", "中华文明", "中国价值", "中国地位"],
      "answer": "C"
    },
    {
      "id": 133,
      "type": "single",
      "question": "以()为源头的中国共产党人精神谱系，是党带领人民战胜艰难险阻、取得一个又一个伟大胜利的精神丰碑。",
      "options": [
        "伟大长征精神",
        "伟大航天精神",
        "伟大井冈山精神",
        "伟大建党精神"
      ],
      "answer": "D"
    },
    {
      "id": 134,
      "type": "single",
      "question": "()是我们立党为国、兴党兴国的根本指导思想。",
      "options": ["全心全意为人民服务", "马克思主义", "无政府主义", "民生主义"],
      "answer": "B"
    },
    {
      "id": 135,
      "type": "single",
      "question": "坚持()在意识形态领域指导地位的根本制度，是坚持和巩固我国社会主义制度、保证我国文化建设正确方向的必然要求。",
      "options": ["“双百”方针", "“二为”方向", "马克思主义", "民生主义"],
      "answer": "C"
    },
    {
      "id": 136,
      "type": "single",
      "question": "体现一个国家综合实力最核心的、最高层的，还是()，这事关一个民族精气神的凝聚。",
      "options": ["经济总量", "文化软实力", "军事力量", "政治力量"],
      "answer": "B"
    },
    {
      "id": 137,
      "type": "single",
      "question": "()是一个国家、一个民族的灵魂。",
      "options": ["经济", "政治", "文化", "社会"],
      "answer": "C"
    },
    {
      "id": 139,
      "type": "single",
      "question": "全面建成小康社会的底线任务是()。",
      "options": [
        "防范和化解重大风险",
        "打赢蓝天保卫战",
        "保持社会和谐稳定",
        "脱贫攻坚"
      ],
      "answer": "D"
    },
    {
      "id": 140,
      "type": "single",
      "question": "目前，世界上减贫人口最多的国家是()。",
      "options": ["美国", "中国", "巴西", "印度"],
      "answer": "B"
    },
    {
      "id": 148,
      "type": "single",
      "question": "()是社会主义生产的根本目的。",
      "options": ["促进经济发展", "促进文化繁荣", "增进民生福祉", "改善生态环境"],
      "answer": "C"
    },
    {
      "id": 149,
      "type": "single",
      "question": "大气污染、水体污染、土壤污染严重制约人民群众的生活质量和幸福感。要破解这一短板问题，必须坚决打好()，从根本上改善我国生态环境。",
      "options": [
        "精准脱贫攻坚战",
        "防范化解重大风险攻坚战",
        "环境污染防治攻坚战",
        "蓝天保卫战"
      ],
      "answer": "C"
    },
    {
      "id": 150,
      "type": "single",
      "question": "改革开放以来，多年快速发展积累的生态环境问题十分突出，老百姓意见大、怨言多。随着人民群众的生活水平不断提高，()应该而且必须成为发展的题中之义。",
      "options": [
        "发展全过程人民民主",
        "增进民生福祉",
        "坚持全面依法治国",
        "保护生态环境、建设美丽中国"
      ],
      "answer": "D"
    },
    {
      "id": 151,
      "type": "single",
      "question": "()是最公平的公共产品，是最普惠的民生福祉。",
      "options": [
        "丰富的物质财富",
        "稳定的政治环境",
        "深厚的传统文化",
        "良好的生态环境"
      ],
      "answer": "D"
    },
    {
      "id": 152,
      "type": "single",
      "question": "保护生态环境必须依靠最严格制度最严密法治，以下说法不正确的是()。",
      "options": [
        "牢固树立生态环境法治理念",
        "生态文明制度体系健全、配套完善",
        "管权治吏、护蓝增绿制度严格",
        "对于失职渎职行为可以放宽处理"
      ],
      "answer": "D"
    },
    {
      "id": 153,
      "type": "single",
      "question": "2021年4月30日，习近平在主持中共十九届中央政治局第二十九次集体学习时的讲话中指出，实现()是我国向世界作出的庄严承诺，也是一场广泛而深刻的经济社会变革，绝不是轻轻松松就能实现的。",
      "options": [
        "美丽中国",
        "碳达峰、碳中和",
        "生态文明建设",
        "社会主义现代化强国目标"
      ],
      "answer": "B"
    },
    {
      "id": 154,
      "type": "single",
      "question": "()对改革生态环境监管作出新部署，进一步理顺环保管理体制，使监管“一杆子插到底”。",
      "options": ["党的十七大", "党的十八大", "党的十九大", "党的二十大"],
      "answer": "C"
    },
    {
      "id": 155,
      "type": "single",
      "question": "中国宣布，力争()年前实现碳达峰。",
      "options": ["2030", "2040", "2050", "2060"],
      "answer": "A"
    },
    {
      "id": 156,
      "type": "single",
      "question": "中国宣布，努力()年前实现碳中和。",
      "options": ["2030", "2040", "2050", "2060"],
      "answer": "D"
    },
    {
      "id": 157,
      "type": "single",
      "question": "生态文明建设是关乎中华民族永续发展的根本大计。要加快推进绿色发展、循环发展、低碳发展，开创()新局面。",
      "options": ["平安中国建设", "美丽中国建设", "健康中国建设", "智慧中国建设"],
      "answer": "B"
    },
    {
      "id": 158,
      "type": "single",
      "question": "推进碳达峰碳中和工作中，发达国家应减少的是“奢侈排放”，中国则是最大限度地克制()。",
      "options": ["奢侈排放", "基本排放", "生存和发展排放", "任意排放"],
      "answer": "C"
    },
    {
      "id": 159,
      "type": "single",
      "question": "()是关乎国家发展稳定和社会长治久安的重大战略问题。",
      "options": ["国家安全", "政权安全", "社会稳定", "制度安全"],
      "answer": "A"
    },
    {
      "id": 160,
      "type": "single",
      "question": "()是国家强盛的前提。",
      "options": ["国家安全", "政权安全", "社会稳定", "制度安全"],
      "answer": "C"
    },
    {
      "id": 161,
      "type": "single",
      "question": "()是人民群众最基本、最普遍的愿望。",
      "options": ["国家统一", "国家安全", "国泰民安", "社会安定"],
      "answer": "C"
    },
    {
      "id": 162,
      "type": "single",
      "question": "()将“坚持总体国家安全观”纳入新时代坚持和发展中国特色社会主义的基本方略，并写入党章。",
      "options": [
        "2012年10月，党的十八大",
        "2014年4月，中央国家安全委员会第一次会议",
        "2017年10月，党的十九大",
        "2022年10月，党的二十大"
      ],
      "answer": "C"
    },
    {
      "id": 163,
      "type": "single",
      "question": "全民国家安全教育日是()",
      "options": ["3月18日", "5月12日", "4月15日", "9月18日"],
      "answer": "C"
    },
    {
      "id": 164,
      "type": "single",
      "question": "()攸关党和国家生死存亡，是国家安全的根本。",
      "options": ["经济安全", "政治安全", "社会安全", "文化安全"],
      "answer": "B"
    },
    {
      "id": 165,
      "type": "single",
      "question": "()与人民群众切身利益关系最密切。",
      "options": ["经济安全", "政治安全", "社会安全", "文化安全"],
      "answer": "C"
    },
    {
      "id": 166,
      "type": "single",
      "question": "()是立国之基。",
      "options": ["政治安全", "政权安全", "国土安全", "经济安全"],
      "answer": "C"
    },
    {
      "id": 167,
      "type": "single",
      "question": "()是维护人民安全和国家利益的根本保证。",
      "options": ["政治安全", "政权安全", "国土安全", "经济安全"],
      "answer": "A"
    },
    {
      "id": 168,
      "type": "single",
      "question": "()是实现政治安全和人民安全的要求和原则。",
      "options": ["制度安全", "保证集体利益", "政权安全", "国家利益至上"],
      "answer": "D"
    },
    {
      "id": 169,
      "type": "single",
      "question": "()是党和国家的一项基础性工作，是我们党治国理政的一个重大原则。",
      "options": [
        "统筹维护国家安全和塑造国家安全",
        "防范化解政治安全风险",
        "统筹发展和安全",
        "维护国家主权、安全和发展利益"
      ],
      "answer": "C"
    },
    {
      "id": 170,
      "type": "single",
      "question": "面对传统安全威胁与非传统安全威胁交织的局面，要坚持()",
      "options": ["亚洲安全观", "共同安全观", "地区集体安全观", "总体国家安全观"],
      "answer": "D"
    },
    {
      "id": 171,
      "type": "single",
      "question": "()是“中国开放的大门越开越大”的重要保证。",
      "options": [
        "统筹开放和安全",
        "推进发展和安全深度融合",
        "统筹自身安全和共同安全",
        "健全开放安全保障体系"
      ],
      "answer": "D"
    },
    {
      "id": 172,
      "type": "single",
      "question": "()是民族复兴的根基。",
      "options": ["政治安全", "国家安全", "国土安全", "意识形态安全"],
      "answer": "B"
    },
    {
      "id": 173,
      "type": "single",
      "question": "党的十九大提出，2035年()",
      "options": [
        "基本实现国防和军队现代化",
        "实现国防和军队现代化",
        "把人民军队全面建成世界一流军队",
        "国防和军队建设基本实现机械化"
      ],
      "answer": "A"
    },
    {
      "id": 174,
      "type": "single",
      "question": "()是实现富国和强军相统一的重要政治保障。",
      "options": ["军政军民团结", "党政军警民合力", "拥政爱民", "拥军优属"],
      "answer": "A"
    },
    {
      "id": 175,
      "type": "single",
      "question": "()关系军队的性质、宗旨、本色。",
      "options": ["军纪严明", "作风优良", "信念坚定", "听党指挥"],
      "answer": "B"
    },
    {
      "id": 176,
      "type": "single",
      "question": "()反映军队的根本职能和军队建设的根本指向。",
      "options": ["听党指挥", "作风优良", "科技强军", "能打胜仗"],
      "answer": "D"
    },
    {
      "id": 177,
      "type": "single",
      "question": "()是军事发展中最活跃、最具革命性的因素。",
      "options": ["改革", "科技", "人才", "政治"],
      "answer": "B"
    },
    {
      "id": 178,
      "type": "single",
      "question": "党对军队的绝对领导是我国的基本军事制度，与中国特色社会主义()相配套相吻合。",
      "options": ["政治制度", "经济制度", "法律制度", "协商制度"],
      "answer": "A"
    },
    {
      "id": 179,
      "type": "single",
      "question": "党对军队的绝对领导是中国特色社会主义的本质特征，是党和国家的重要()优势。",
      "options": ["政治", "管理", "制度", "思想"],
      "answer": "A"
    },
    {
      "id": 180,
      "type": "single",
      "question": "()是现代战争的核心战斗力。",
      "options": ["经济实力", "武器装备", "科技", "组织建设"],
      "answer": "C"
    },
    {
      "id": 181,
      "type": "single",
      "question": "()是人民军队的立军之本。",
      "options": ["改革强军", "依法治军", "政治建军", "人才强军"],
      "answer": "C"
    },
    {
      "id": 182,
      "type": "single",
      "question": "()是推动人民军队高质量发展、赢得军事竞争和未来战争主动的关键因素。",
      "options": ["人才", "改革", "政治", "科技"],
      "answer": "A"
    },
    {
      "id": 183,
      "type": "single",
      "question": "军队要牢固树立()这个唯一的根本的标准。",
      "options": ["信仰", "纪律", "战斗力", "担当"],
      "answer": "C"
    },
    {
      "id": 184,
      "type": "single",
      "question": "()决定军队建设的政治方向。",
      "options": ["听党指挥", "能打胜仗", "作风优良", "政治建军"],
      "answer": "A"
    },
    {
      "id": 185,
      "type": "single",
      "question": "“一国两制”构想最早是针对()问题提出来的。",
      "options": ["香港", "澳门", "台湾", "大陆"],
      "answer": "C"
    },
    {
      "id": 186,
      "type": "single",
      "question": "1997年()正式回归祖国。",
      "options": ["香港", "澳门", "台湾", "大陆"],
      "answer": "A"
    },
    {
      "id": 187,
      "type": "single",
      "question": "()年澳门正式回归祖国。",
      "options": ["1997", "1998", "1999", "2000"],
      "answer": "C"
    },
    {
      "id": 188,
      "type": "single",
      "question": "中央政府对特别行政区拥有()，是授权特别行政区高度自治的前提和基础。",
      "options": ["任命权", "行政管理权", "立法权", "全面管治权"],
      "answer": "D"
    },
    {
      "id": 189,
      "type": "single",
      "question": "2020年6月30日，为堵塞香港国家安全法律漏洞，保持香港繁荣稳定，保障香港居民合法权益，第十三届全国人大常委会第二十次会议表决通过()。",
      "options": [
        "《中华人民共和国香港特别行政区维护国家安全法》",
        "《宪法》",
        "《刑法》",
        "《反分裂国家法》"
      ],
      "answer": "A"
    },
    {
      "id": 190,
      "type": "single",
      "question": "“一个国家、两种制度、三个关税区、三种货币”之下的()是习近平总书记亲自谋划、亲自部署、亲自推动的重大国家战略。",
      "options": [
        "西部大开发",
        "京津冀协同发展战略",
        "粤港澳大湾区建设",
        "雄安新区建设"
      ],
      "answer": "C"
    },
    {
      "id": 191,
      "type": "single",
      "question": "当前，粤港澳大湾区建设已取得重要阶段性成果，()不属于粤港澳大湾区建设成果。",
      "options": ["广深澳高铁", "雄安新区", "珠海横琴合作平台", "港珠澳大桥"],
      "answer": "B"
    },
    {
      "id": 192,
      "type": "single",
      "question": "依法治理是最可靠、最稳定的治理。宪法和()共同构成特别行政区的宪制基础。",
      "options": ["基本法", "一国两制", "国家安全法", "九二共识"],
      "answer": "A"
    },
    {
      "id": 193,
      "type": "single",
      "question": "九条方针是以()的名义提出来的，实际上就是一个国家，两种制度。",
      "options": ["毛泽东", "叶剑英", "邓小平", "周恩来"],
      "answer": "B"
    },
    {
      "id": 194,
      "type": "single",
      "question": "台湾问题的本质是()。",
      "options": [
        "中国同美国的关系问题",
        "中国同日本的关系问题",
        "中国的内政问题",
        "共产党与国民党的关系问题"
      ],
      "answer": "C"
    },
    {
      "id": 195,
      "type": "single",
      "question": "我国目前在对待统一问题上使用的是“一国两制”的政策，但它不会改变我国人民民主的国家性质，这是因为()。",
      "options": [
        "两种制度地位不同，社会主义制度是主体",
        "特别行政区是在中华人民共和国中央人民政府的统一领导下",
        "特别行政区只是中华人民共和国的一个行政区域",
        "特别行政区享有内地一般地方行政区所没有的高度自治权"
      ],
      "answer": "A"
    },
    {
      "id": 196,
      "type": "single",
      "question": "我们应大力弘扬和平、发展、公平、正义、民主、自由的全人类共同价值，共同价值，共同为建设一个更加美好的世界提供正确理念指引。以下说法不正确的是()",
      "options": [
        "和平与发展是我们共同的事业",
        "公平正义是我们共同的理想",
        "民主自由是我们共同的追求",
        "开放包容是我们共同的期待"
      ],
      "answer": "D"
    },
    {
      "id": 197,
      "type": "single",
      "question": "中国特色大国外交牢牢把握()的主线。",
      "options": [
        "服务民族复兴、促进人类进步",
        "高举中国特色社会主义伟大旗帜",
        "构建人类命运共同体",
        "独立自主"
      ],
      "answer": "A"
    },
    {
      "id": 198,
      "type": "single",
      "question": "世界潮流，浩浩荡荡，顺之则昌，逆之则亡。我们应大力弘扬()的全人类共同价值，共同为建设一个更加美好的世界提供正确理念指引。",
      "options": [
        "和平、发展、高效、正义、民主、自由",
        "和平、发展、公平、正义、民主、自由",
        "和平、发展、公平、正义、包容、自由",
        "和平、发展、公平、正义、民主、繁荣"
      ],
      "answer": "B"
    },
    {
      "id": 199,
      "type": "single",
      "question": "面向未来，中国将同各方继续高质量共建“一带一路”践行共商共建共享原则，弘扬开放、绿色、廉洁理念，努力实现高标准、惠民生、可持续目标。以下关于“一带一路”说法错误的是()",
      "options": [
        "“一带一路”的追求是发展",
        "“一带一路”的追求是开放",
        "“一带一路”崇尚的是共赢",
        "“一带一路”传递的是希望"
      ],
      "answer": "B"
    },
    {
      "id": 200,
      "type": "single",
      "question": "“一带一路”的底色是()。",
      "options": ["绿色", "红色", "蓝色", "白色"],
      "answer": "A"
    },
    {
      "id": 201,
      "type": "single",
      "question": "到2030年，共建“一带一路”有望帮助全球760万人摆脱贫困、3200万人摆脱中度贫困。我们将本着()的精神，同愿意参与的各相关方共同努力，把“一带一路”建设成“减贫之路”“增长之路”，为人类走向共同繁荣做出积极贡献。",
      "options": ["开放进取", "开放包容", "竞争有序", "合作共赢"],
      "answer": "B"
    },
    {
      "id": 202,
      "type": "single",
      "question": "新时代中国外交的基本原则是()。",
      "options": ["独立自主", "合作共赢、共同发展", "走和平发展道路", "互利共赢"],
      "answer": "C"
    },
    {
      "id": 203,
      "type": "single",
      "question": "“治国常富，而乱国常贫”，安全是发展的前提，人类是不可分割的安全共同体。为了促进世界安危与共，以下关于中方愿提出共建安全观说法正确的是()。",
      "options": [
        "共通、综合、合作、可持续的安全观",
        "共同、融合、合作、可持续的安全观",
        "共同、综合、发展、可持续的安全观",
        "共同、综合、合作、可持续的安全观"
      ],
      "answer": "D"
    },
    {
      "id": 204,
      "type": "single",
      "question": "()是发展的前提，是人类最基本最普遍的愿望，是各国人民根本利益所在。",
      "options": ["和平", "平等", "安全", "开放"],
      "answer": "C"
    },
    {
      "id": 205,
      "type": "single",
      "question": "统筹国内国际两个大局，始终不渝走和平发展道路、奉行互利共赢的开放战略，坚持正确义利观，树立共同、综合、合作、可持续的新安全观，这些内容体现了新时代中国特色社会主义基本方略中的()",
      "options": [
        "坚持新发展理念",
        "坚持在发展中保障和改善民生",
        "坚持人与自然和谐共生",
        "坚持推动构建人类命运共同体"
      ],
      "answer": "D"
    },
    {
      "id": 206,
      "type": "single",
      "question": "确立互利共赢的思想基础是()",
      "options": ["实事求是", "改革开放", "命运共同体意识", "社会主义核心价值观"],
      "answer": "C"
    },
    {
      "id": 207,
      "type": "single",
      "question": "思想建设是党的()建设。",
      "options": ["根本性", "关键性", "基础性", "全局性"],
      "answer": "C"
    },
    {
      "id": 208,
      "type": "single",
      "question": "政治建设是党的()建设。",
      "options": ["关键性", "基础性", "根本性", "全局性"],
      "answer": "C"
    },
    {
      "id": 209,
      "type": "single",
      "question": "作风问题核心是()\nA．选人用人问题\nB．政治路线问题\nC．党同人民群众的关系问题\nD．思想建设",
      "options": [],
      "answer": "C"
    },
    {
      "id": 210,
      "type": "single",
      "question": "中国共产党独特的自身优势不包括()",
      "options": [
        "雄厚的资金、精良的装备",
        "以马克思主义为指导，用马克思主义中国化理论成果武装全党、教育人民的理论优势",
        "坚定崇高的政治理想、政治信念和百折不挠的革命意志的政治优势",
        "实行民主集中制的制度优势"
      ],
      "answer": "A"
    },
    {
      "id": 211,
      "type": "single",
      "question": "中国共产党最鲜明的品格是()",
      "options": [
        "理论联系实际",
        "密切联系群众",
        "勇于自我革命",
        "谦虚谨慎、不骄不躁"
      ],
      "answer": "C"
    },
    {
      "id": 212,
      "type": "single",
      "question": "新时代党的建设目标是()",
      "options": [
        "坚持和加强党的全面领导，坚持党要管党、全面从严治党",
        "加强党的执政能力建设、先进性和纯洁性建设",
        "全面推进党的政治建设、思想建设、组织建设、作风建设、纪律建设",
        "把党建设成为始终走在时代前列、人民衷心拥护、勇于自我革命、经得起各种风浪考验、朝气蓬勃的马克思主义执政党"
      ],
      "answer": "D"
    },
    {
      "id": 213,
      "type": "single",
      "question": "()是党内监督的战略性制度安排。",
      "options": ["请示报告制度", "派驻监督", "巡视制度", "问责制度"],
      "answer": "C"
    },
    {
      "id": 214,
      "type": "single",
      "question": "加强和规范党内政治生活，必须以()为根本遵循。",
      "options": ["党章", "法律", "党内监督条例", "宪法"],
      "answer": "A"
    }
  ]
  

const multipleChoice: Question[] = [
    {
      "id": 1,
      "type": "single",
      "question": "新时代是什么样的时代？()",
      "options": [
        "是承前启后、继往开来、在新的历史条件下继续夺取中国特色社会主义伟大胜利的时代",
        "是决胜全面建成小康社会、进而全面建设社会主义现代化强国的时代",
        "是全国各族人民团结奋斗、不断创造美好生活、逐步实现全体人民共同富裕的时代",
        "是全体中华儿女勠力同心、奋力实现中华民族伟大复兴中国梦的时代、是我国不断为人类作出更大贡献的时代"
      ],
      "answer": "ABCD"
    },
    {
      "id": 2,
      "type": "single",
      "question": "习近平新时代中国特色社会主义思想是对()的继承和发展，是当代中国马克思主义、二十一世纪马克思主义，是中华文化和中国精神的时代精华，是党和人民实践经验和集体智慧的结晶。",
      "options": [
        "马克思列宁主义",
        "毛泽东思想",
        "邓小平理论",
        "“三个代表”重要思想",
        "科学发展观"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 3,
      "type": "single",
      "question": "如何学好用好习近平新时代中国特色社会主义思想()",
      "options": [
        "坚定理想信念",
        "提高理论水平",
        "增强实践能力",
        "提高思想境界"
      ],
      "answer": "ABC"
    },
    {
      "id": 4,
      "type": "single",
      "question": "中国特色社会主义进入了新时代这一判断基于()",
      "options": [
        "我国发展站到新的历史起点上",
        "我国社会主要矛盾发生了新变化",
        "党的奋斗目标有了新要求",
        "我国面临的国际环境发生了新变化",
        "我国人民群众有了新的需求"
      ],
      "answer": "ABCD"
    },
    {
      "id": 5,
      "type": "single",
      "question": "我国社会主要矛盾的变化()",
      "options": [
        "没有改变我们对我国社会主义所处历史阶段的判断",
        "没有改变我国仍处于并将长期处于社会主义初级阶段的基本国情",
        "没有改变我国是世界最大发展中国家的国际地位",
        "没有改变此前我们对我国发展所处历史方位的判断",
        "没有改变我国人民群众的基本生活状态"
      ],
      "answer": "ABC"
    },
    {
      "id": 6,
      "type": "single",
      "question": "2035年，我国将基本实现现代化，意味着()",
      "options": [
        "将跻身创新型国家前列",
        "国家治理体系和治理能力现代化基本实现",
        "社会文明程度达到新高度",
        "进入发达国家行列",
        "实现美丽中国目标"
      ],
      "answer": "ABC"
    },
    {
      "id": 7,
      "type": "single",
      "question": "()是坚定理想信念的前提。",
      "options": [
        "认识真理",
        "掌握真理",
        "信仰真理",
        "坚定信心"
      ],
      "answer": "ABC"
    },
    {
      "id": 8,
      "type": "single",
      "question": "中国特色社会主义不是从天上掉下来的，而是在()中得来的。",
      "options": [
        "改革开放40多年的伟大实践",
        "新中国成立70多年的持续探索中",
        "中国共产党领导人民进行伟大社会革命100多年的实践",
        "近代以来中华民族由衰到盛180多年的历史进程",
        "世界社会主义500多年波澜壮阔的发展历程",
        "对中华文明5000多年的传承发展"
      ],
      "answer": "ABCDEF"
    },
    {
      "id": 9,
      "type": "single",
      "question": "中国特色社会主义是()的辩证统一。",
      "options": [
        "科学社会主义理论逻辑",
        "科学发展观的理论逻辑",
        "中国社会发展历史逻辑",
        "中国社会发展的实践逻辑"
      ],
      "answer": "AC"
    },
    {
      "id": 10,
      "type": "single",
      "question": "改革开放以来我们取得一切成绩和进步的根本原因，归结起来就是()",
      "options": [
        "开辟了中国特色社会主义道路",
        "形成了中国特色社会主义理论体系",
        "确立了中国特色社会主义制度",
        "发展了中国特色社会主义文化"
      ],
      "answer": "ABCD"
    },
    {
      "id": 11,
      "type": "single",
      "question": "新时代坚持和发展中国特色社会主义，必须坚定()",
      "options": [
        "道路自信",
        "理论自信",
        "制度自信",
        "文化自信"
      ],
      "answer": "ABCD"
    },
    {
      "id": 12,
      "type": "single",
      "question": "中国特色社会主义道路自信、理论自信、制度自信、文化自信，来源于()",
      "options": [
        "实践",
        "人民",
        "社会",
        "真理"
      ],
      "answer": "ABD"
    },
    {
      "id": 13,
      "type": "single",
      "question": "中国特色社会主义进入新时代，意味着()",
      "options": [
        "意味着近代以来久经磨难的中华民族迎来了从站起来、富起来到强起来的伟大飞跃，迎来了实现中华民族伟大复兴的光明前景",
        "意味着科学社会主义在21世纪的中国焕发出强大的生机活力，在世界上高高举起了中国特色社会主义伟大旗帜",
        "意味着中国特色社会主义道路、理论、制度、文化不断发展，拓展了发展中国家走向现代化的途径，给世界上那些既希望加快发展又希望保持自身独立性的国家和民族提供了全新选择，为解决人类问题贡献了中国智慧和中国方案",
        "意味着中华民族从此站立起来，屹立在民族之林"
      ],
      "answer": "ABC"
    },
    {
      "id": 14,
      "type": "single",
      "question": "党的()事关党的前途命运、事关中国特色社会主义事业的兴衰成败。",
      "options": [
        "基本理论",
        "基本路线",
        "基本经验",
        "基本方略",
        "基本政策"
      ],
      "answer": "ABD"
    },
    {
      "id": 15,
      "type": "single",
      "question": "在新征程上，统筹推进“五位一体”总体布局、协调推进“四个全面”战略布局，必须紧紧扭住()三个战略举措不放松。",
      "options": [
        "全面深化改革",
        "全面依法治国",
        "全面建设小康社会",
        "全面从严治党"
      ],
      "answer": "ABD"
    },
    {
      "id": 16,
      "type": "single",
      "question": "新时代新征程中国共产党的中心任务，就是()。",
      "options": [
        "团结带领全国各族人民全面建成社会主义现代化强国",
        "实现第二个百年奋斗目标",
        "以中国式现代化全面推进中华民族伟大复兴",
        "建设成为发达国家"
      ],
      "answer": "ABC"
    },
    {
      "id": 17,
      "type": "single",
      "question": "实现中华民族伟大复兴的中国梦，本质是()",
      "options": [
        "国家富强",
        "民族振兴",
        "人民富裕",
        "人民幸福"
      ],
      "answer": "ABD"
    },
    {
      "id": 18,
      "type": "single",
      "question": "进入新时代，全面建成小康社会，强调的不仅仅是“小康”，而且更重要的也是更难做到的是“全面”。小康讲的是发展水平，全面讲的是发展的()",
      "options": [
        "平衡性",
        "系统性",
        "协调性",
        "可持续性"
      ],
      "answer": "ACD"
    },
    {
      "id": 19,
      "type": "single",
      "question": "我国已经是()",
      "options": [
        "世界第一制造业大国",
        "全球货物贸易第一大国",
        "外汇储备第一大国",
        "人均国民生产总值第一大国"
      ],
      "answer": "ABC"
    },
    {
      "id": 20,
      "type": "single",
      "question": "党的二十大明确指出，全面建成社会主义现代化强国总的战略安排是分两步走：()",
      "options": [
        "从2020年到2035年基本实现社会主义现代化",
        "从2020年到2030年基本实现社会主义现代化",
        "从2030年到本世纪中叶把我国建设成为富强民主文明和谐美丽的社会主义现代化强国",
        "从2035年到本世纪中叶把我国建设成为富强民主文明和谐美丽的社会主义现代化强国"
      ],
      "answer": "AD"
    },
    {
      "id": 21,
      "type": "single",
      "question": "中国式现代化的中国特色指的是()",
      "options": [
        "中国式现代化是人口规模巨大的现代化",
        "中国式现代化是全体人民共同富裕的现代化",
        "中国式现代化是物质文明和精神文明相协调的现代化",
        "中国式现代化是人与自然和谐共生的现代化",
        "中国式现代化是走和平发展道路的现代化"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 22,
      "type": "single",
      "question": "中国式现代化的本质要求是()。",
      "options": [
        "坚持中国共产党的领导",
        "坚持中国特色社会主义",
        "实现高质量发展，发展全过程人民民主，丰富人民精神世界，实现全体人民共同富裕",
        "促进人与自然和谐共生，推动构建人类命运共同体，创造人类文明新形态"
      ],
      "answer": "ABCD"
    },
    {
      "id": 23,
      "type": "single",
      "question": "党的领导直接关系中国式现代化的()",
      "options": [
        "根本方向",
        "根本途径",
        "前途命运",
        "最终成败"
      ],
      "answer": "ACD"
    },
    {
      "id": 24,
      "type": "single",
      "question": "中国式现代化蕴含的独特的()等其伟大实践，是对世界现代化理论和实践的伟大创新。",
      "options": [
        "世界观",
        "价值观",
        "历史观",
        "文明观",
        "民主观"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 25,
      "type": "single",
      "question": "中国特色社会主义之所以是社会主义，究其根本就在于()。",
      "options": [
        "坚持科学社会主义基本原则",
        "坚持中国共产党的领导",
        "坚持社会主义制度",
        "坚持马克思主义"
      ],
      "answer": "AB"
    },
    {
      "id": 26,
      "type": "single",
      "question": "要坚持和加强党的领导制度，使党的()显著增强。",
      "options": [
        "政治领导力",
        "思想引领力",
        "群众组织力",
        "社会号召力"
      ],
      "answer": "ABCD"
    },
    {
      "id": 27,
      "type": "single",
      "question": "中国共产党作为最高政治领导力量是由()决定的。",
      "options": [
        "我国国家性质",
        "我国社会制度",
        "政治制度体系",
        "社会阶级性质"
      ],
      "answer": "AC"
    },
    {
      "id": 28,
      "type": "single",
      "question": "维护党中央权威和集中统一领导，必须（），这是（）。()",
      "options": [
        "坚决贯彻党的理论、路线方针政策",
        "党中央决策部署",
        "坚持和加强党中央集中统一领导的必然要求",
        "是各级党组织和全体党员应尽的责任和义务"
      ],
      "answer": "ABCD"
    },
    {
      "id": 29,
      "type": "single",
      "question": "中国共产党的执政地位是在长期革命斗争中逐步形成的，是近代中国历史发展的必然，是人民拥护和选择的结果。中国共产党成立以后，团结带领中国人民()",
      "options": [
        "完成新民主主义革命，建立了中华人民共和国",
        "完成社会主义革命，确立了社会主义基本制度，推进了社会主义建设",
        "进行改革开放新的伟大革命，极大解放和发展社会生产力",
        "完成了社会主义工业化",
        "实现了社会主义现代化强国"
      ],
      "answer": "ABC"
    },
    {
      "id": 30,
      "type": "single",
      "question": "伟大斗争、伟大工程、伟大事业、伟大梦想是一个紧密联系、相互贯通、相互作用、有机统一的整体，统一于新时代坚持和发展中国特色社会主义伟大实践。以下表述正确的是()",
      "options": [
        "伟大梦想是目标，指引前进方向",
        "伟大事业是主题，开辟前进道路",
        "伟大斗争是手段，激发前进动力",
        "伟大工程是保障，提供前进保证",
        "伟大工程起决定性作用"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 31,
      "type": "single",
      "question": "坚持以人民为中心的发展思想，在高质量发展中促进共同富裕，需要在收入分配中做到()，促进社会的公平正义。",
      "options": [
        "形成上面小底下大的金字塔型分配结构",
        "增加低收入群体收入",
        "取缔高收入",
        "取缔非法收入",
        "形成中间大、两头小的橄榄型分配结构"
      ],
      "answer": "BDE"
    },
    {
      "id": 32,
      "type": "single",
      "question": "共同富裕具有丰富的涵义，包括()",
      "options": [
        "全体人民共同富裕",
        "人民群众物质生活和精神生活都富裕",
        "不是少数人的富裕",
        "不是整齐划一的平均主义",
        "是指人民群众基本同等富裕"
      ],
      "answer": "ABCD"
    },
    {
      "id": 33,
      "type": "single",
      "question": "要扎实推动共同富裕，需要做到()",
      "options": [
        "提高发展的平衡性、协调性、包容性",
        "加强对高收入的规范和调节",
        "加强对中等收入的规范和调节",
        "促进基本公共服务均等化",
        "缩小中等收入群体规模"
      ],
      "answer": "ABD"
    },
    {
      "id": 34,
      "type": "single",
      "question": "党的十九届五中全会强调，要把()作为2035年基本实现社会主义现代化远景目标的重要内容。",
      "options": [
        "人民生活更加美好",
        "实现全体人民共同富裕",
        "基本实现全体人民共同富裕",
        "人的全面发展",
        "全体人民共同富裕取得更为明显的实质性进展"
      ],
      "answer": "ADE"
    },
    {
      "id": 35,
      "type": "single",
      "question": "要实现共同富裕，就必须做到()",
      "options": [
        "居民收入差距持续缩小",
        "推进基本公共服务均等化",
        "中等收入群体规模不断扩大",
        "基本形成以中等收入群体为主体的金字塔社会结构",
        "使群众的生活品质不断提升"
      ],
      "answer": "ABCE"
    },
    {
      "id": 36,
      "type": "single",
      "question": "关于党和人民的关系，以下判断错误的是()",
      "options": [
        "党性和人民性绝大多数时候是一致的",
        "党性寓于人民性之中",
        "党和人民的根本利益是一致的",
        "党和人民的根本利益有时不一致",
        "党性和人民性从来都是一致的"
      ],
      "answer": "AD"
    },
    {
      "id": 37,
      "type": "single",
      "question": "只有扎实推进共同富裕，党领导人民才能妥善处理好现代化进程中()等重大关系，才能切实防范与化解现代化进程中的重大风险。",
      "options": [
        "效率与公平",
        "改革与开放",
        "分化与整合",
        "发展与稳定",
        "开放与自主"
      ],
      "answer": "ACDE"
    },
    {
      "id": 38,
      "type": "single",
      "question": "“十四五”规划和2035年远景目标积极回应了人民群众的诉求和期盼，提出要使()",
      "options": [
        "居民收入分配结构明显改善",
        "降低中产阶层比重",
        "提高低收入群体比重",
        "降低“新的社会阶层人士”比重",
        "脱贫攻坚成果巩固拓展"
      ],
      "answer": "AE"
    },
    {
      "id": 39,
      "type": "single",
      "question": "以下论断错误的是()",
      "options": [
        "到本世纪中叶，我国实现全体人民共同富裕",
        "到2035年，我国居民收入和实际消费水平差距缩小到合理区间",
        "到本世纪中叶，我国基本实现全体人民共同富裕",
        "到2035年，我国全体人民共同富裕取得更为明显的实质性进展",
        "到2035年，我国基本公共服务实现均等化"
      ],
      "answer": "AB"
    },
    {
      "id": 40,
      "type": "single",
      "question": "实现共同富裕，()",
      "options": [
        "是中国特色社会主义的本质要求",
        "是中国式现代化的重要特征",
        "要着力扩大高收入群体规模",
        "要实现基本公共服务普及普惠",
        "不包括生态文明的提升"
      ],
      "answer": "ABD"
    },
    {
      "id": 41,
      "type": "single",
      "question": "促进共同富裕需要把握的基本原则有()",
      "options": [
        "鼓励勤劳创新致富",
        "鼓励人民群众的创新",
        "尽力而为量力而行",
        "坚持循序渐进",
        "坚持基本经济制度"
      ],
      "answer": "ACDE"
    },
    {
      "id": 42,
      "type": "single",
      "question": "我国国家制度和国家治理体系13个方面的显著优势是我们坚定中国特色社会主义()的基本依据。",
      "options": [
        "道路自信",
        "思想自信",
        "理论自信",
        "制度自信",
        "文化自信"
      ],
      "answer": "ACDE"
    },
    {
      "id": 43,
      "type": "single",
      "question": "改革开放的目标包括()",
      "options": [
        "解决好生产力和生产关系的矛盾，解放和发展生产力",
        "解决好经济基础和上层建筑的矛盾，完善和发展社会主义制度",
        "进行广泛而深刻的社会变革，推动走出一条中国式现代化道路",
        "吸收人类一切文明成果",
        "创造人类文明新形态"
      ],
      "answer": "ABCE"
    },
    {
      "id": 44,
      "type": "single",
      "question": "中国特色社会主义制度是一个严密完整的科学制度体系，起四梁八柱作用的是根本制度、基本制度、重要制度，包括()等制度",
      "options": [
        "人民代表大会制度",
        "马克思主义在意识形态领域指导地位的制度",
        "统筹城乡的民生保障制度",
        "共建共治共享的社会治理制度",
        "以公有制为主体、多种所有制经济共同发展的基本经济制度"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 45,
      "type": "single",
      "question": "“一带一路”战略秉持的理念是和平合作和()",
      "options": [
        "市场运作",
        "多元平衡",
        "互学互鉴",
        "互利共赢",
        "开放包容"
      ],
      "answer": "CDE"
    },
    {
      "id": 46,
      "type": "single",
      "question": "全面深化改革的对象包括()",
      "options": [
        "劳动力流动体制",
        "户籍制度",
        "利率体系",
        "资源性产品价格",
        "生态文明体制"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 47,
      "type": "single",
      "question": "在全面深化改革中，我国提出了一系列放活民间投资的普惠政策，如保障民企平等使用土地、减免税收等。实施这些政策的目的是()",
      "options": [
        "保证各种所有制经济依法平等使用生产要素",
        "鼓励所有民企建立现代企业制度",
        "保证各种所有制经济公开公平公正参与市场竞争",
        "允许各种所有制经济实行企业员工持股",
        "鼓励国有企业建立现代企业制度"
      ],
      "answer": "AC"
    },
    {
      "id": 48,
      "type": "single",
      "question": "关于“一带一路”，以下正确的是()",
      "options": [
        "“一带一路”倡议的努力方向是构建对外开放新格局",
        "只要认同丝路精神，所有的国家都可以以合适的方式来参与共建“一带一路”",
        "2016年，“一带一路”倡议被联合国写入决议",
        "“一带一路”倡议的基本原则是共商共建共享",
        "“引进来”和“走出去”是“一带一路”国际合作的重要内容"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 49,
      "type": "single",
      "question": "“一带一路”战略包括五个方面的主要内容：政策沟通和()",
      "options": [
        "设施联通",
        "产业互通",
        "贸易畅通",
        "资金融通",
        "民心相通"
      ],
      "answer": "ACDE"
    },
    {
      "id": 50,
      "type": "single",
      "question": "全面深化改革中，要处理好的几大关系是()",
      "options": [
        "解放思想和实事求是的关系",
        "胆子要大和整体推进的关系",
        "改革、发展、稳定的关系",
        "行政命令和群众探索的关系",
        "顶层设计和摸着石头过河的关系"
      ],
      "answer": "ACE"
    },
    {
      "id": 51,
      "type": "single",
      "question": "我国推进“一带一路”建设旨在()",
      "options": [
        "统筹国内国际两个大局",
        "促进沿线各国共同繁荣",
        "打造开放、包容、均衡、普惠的区域经济合作架构",
        "为中国争取更多的经济利益",
        "探索国际合作及全球治理新模式"
      ],
      "answer": "ABCE"
    },
    {
      "id": 52,
      "type": "single",
      "question": "全面深化改革中，我们必须牢牢把握总目标，实施好路线图，包括()",
      "options": [
        "紧紧围绕使市场在资源配置中起决定性作用和更好发挥政府作用，深化政治体制改革",
        "紧紧围绕坚持党的领导、人民当家作主、依法治国有机统一，深化政治体制改革",
        "紧紧围绕建设美丽中国，深化经济体制改革",
        "紧紧围绕提高科学执政、民主执政、依法执政水平，深化政治体制改革",
        "紧紧围绕更好保障和改善民生、促进社会公平正义，深化社会体制改革"
      ],
      "answer": "BE"
    },
    {
      "id": 53,
      "type": "single",
      "question": "全面深化改革是一场深刻的制度变革，制度的“立”和“破”都必须于法有据，()",
      "options": [
        "要做到先推进改革，再推进法治",
        "要做到先推进法治，再推进改革",
        "要做到改革和法治同步推进",
        "要积极发挥法治引导、推动、规范、保障改革的作用",
        "要积极发挥改革引导、推动、规范、保障法治的作用"
      ],
      "answer": "CD"
    },
    {
      "id": 54,
      "type": "single",
      "question": "改革发展稳定是我国社会主义现代化建设的三个重要支点，三者之间的关系可以表述为()",
      "options": [
        "发展是经济社会发展的强大动力",
        "发展是解决一切经济社会问题的关键",
        "改革是解决一切经济社会问题的关键",
        "稳定是改革发展的前提",
        "稳定是经济社会发展的强大动力"
      ],
      "answer": "BD"
    },
    {
      "id": 55,
      "type": "single",
      "question": "关于新发展理念，以下判断错误的是()",
      "options": [
        "绿色发展是中国特色社会主义的本质要求",
        "协调发展不是平均主义，而是更加注重结果公平",
        "开放注重解决发展的内外联动",
        "创新不包括理论创新，主要指科技创新\nE．共享的目标是解决社会公平正义问题"
      ],
      "answer": "ABD"
    },
    {
      "id": 57,
      "type": "single",
      "question": "供给侧结构性改革的主要任务包括三去一降一补，其中“三去”包括：\n()",
      "options": [
        "去库存",
        "去产能",
        "去杠杆",
        "去债务",
        "去成本"
      ],
      "answer": "ABC"
    },
    {
      "id": 58,
      "type": "single",
      "question": "我国深化供给侧结构性改革的原因()",
      "options": [
        "人口红利逐渐增强",
        "我国经济发展面临激烈的外部竞争",
        "产业结构转型升级的需要",
        "建设现代化经济体系的需要",
        "提升企业创新能力和竞争力的需要"
      ],
      "answer": "BCDE"
    },
    {
      "id": 59,
      "type": "single",
      "question": "关于供给侧结构性改革，()",
      "options": [
        "改革的重点是减少无效供给，扩大有效供给",
        "改革需要增强供给侧结构对需求变化的适应性、灵活性",
        "我国经济发展面临的矛盾中，主要方面在需求侧",
        "改革的重点任务是“三去一降一补”",
        "为大力破除无效供给，需要清理“僵尸企业”"
      ],
      "answer": "ABDE"
    },
    {
      "id": 60,
      "type": "single",
      "question": "关于我国的现代化经济体系，以下判断错误的是()",
      "options": [
        "必须坚持质量第一的原则",
        "必须努力实现到2035年跻身创新型国家行列的目标",
        "必须推动资源要素向现代金融业集聚",
        "必须改革国有资本授权经营体制",
        "必须积极推动城乡协调发展"
      ],
      "answer": "BC"
    },
    {
      "id": 61,
      "type": "single",
      "question": "加快完善社会主义市场经济体制，我们需要()",
      "options": [
        "毫不动摇巩固和发展非公有制经济",
        "毫不动摇鼓励、支持、引导非公有制经济",
        "激发全社会创新创业活力",
        "实施积极的货币政策",
        "实施积极的财政政策"
      ],
      "answer": "BCE"
    },
    {
      "id": 62,
      "type": "single",
      "question": "社会主义市场经济条件下，()",
      "options": [
        "公有制经济可以替代非公有制经济",
        "要积极推进混合所有制经济发展",
        "非公有制经济可以部分替代公有制经济",
        "公有制经济只包括国有经济和集体经济",
        "公有制经济不仅仅包括国有经济和集体经济"
      ],
      "answer": "BE"
    },
    {
      "id": 63,
      "type": "single",
      "question": "促进区域协调发展，要推进以人为核心的新型城镇化，()",
      "options": [
        "把促进所有在城镇的人口有序实现市民化作为首要任务\nB．把促进有能力在城镇稳定就业和生活的常住人口有序实现市民化作为首要任务",
        "推进以地级市为重要载体的城镇化建设",
        "推进以县城为重要载体的城镇化建设",
        "提高城镇人口素质和居民生活质量"
      ],
      "answer": "BDE"
    },
    {
      "id": 64,
      "type": "single",
      "question": "建设现代化产业体系，需要大力发展战略性新兴产业，构建()等一批新的增长引擎。",
      "options": [
        "人工智能",
        "新能源",
        "生物技术",
        "航空航天",
        "高端装备"
      ],
      "answer": "ABCE"
    },
    {
      "id": 65,
      "type": "single",
      "question": "当前，我国大力推动构建新发展格局的重点举措包括()",
      "options": [
        "大力发展实体经济",
        "大力发展虚拟经济",
        "实施“一带一路”战略",
        "着力加快科技自立自强",
        "着力推动产业链供应链优化升级"
      ],
      "answer": "ADE"
    },
    {
      "id": 66,
      "type": "single",
      "question": "新形势下促进区域协调发展，总的思路是()",
      "options": [
        "发挥各地区的比较优势",
        "增强县城的经济和人口承载能力",
        "增强中心城市和城市群的经济和人口承载能力",
        "增强其他地区在保障粮食安全、生态安全和边疆安全方面的功能\nE．形成主体功能明显、优势互补的区域经济布局"
      ],
      "answer": "ACDE"
    },
    {
      "id": 67,
      "type": "single",
      "question": "坚持和完善我国的基本分配制度，要()",
      "options": [
        "努力推动居民收入增长和经济增长保持同比例",
        "努力推动劳动报酬和劳动生产率同步提高",
        "完善企业的工资集体协商制度",
        "提高劳动报酬在再分配中的比重",
        "健全生产要素由市场评价贡献、按贡献决定报酬的机制"
      ],
      "answer": "BCE"
    },
    {
      "id": 68,
      "type": "single",
      "question": "()是全面建设社会主义现代化的基础性、战略性支撑。",
      "options": [
        "教育",
        "科技",
        "人才",
        "理论"
      ],
      "answer": "ABC"
    },
    {
      "id": 69,
      "type": "single",
      "question": "现代化强国，必定是()",
      "options": [
        "教育强国",
        "科技强国",
        "人才强国",
        "经济强国"
      ],
      "answer": "ABC"
    },
    {
      "id": 70,
      "type": "single",
      "question": "加快建设教育强国的意义是()",
      "options": [
        "是全面建成社会主义现代化强国的战略先导",
        "是实现高水平科技自立自强的重要支撑",
        "是促进全体人民共同富裕的有效途径",
        "是以中国式现代化全面推进中华民族伟大复兴的基础工程"
      ],
      "answer": "ABCD"
    },
    {
      "id": 71,
      "type": "single",
      "question": "坚持党对教育工作的全面领导是办好教育的根本保证，要把教育工作领导权牢牢掌握在党的手里，要建立健全()的教育领导体制。",
      "options": [
        "党委统一领导",
        "党政齐抓共管",
        "部门各负其责",
        "社会协同"
      ],
      "answer": "ABC"
    },
    {
      "id": 72,
      "type": "single",
      "question": "育人的根本在于立德。落实立德树人根本任务，必须着力解决好()问题，这是教育的根本问题。",
      "options": [
        "培养什么人",
        "怎样培养人",
        "为谁培养人",
        "如何更好培养人"
      ],
      "answer": "ABC"
    },
    {
      "id": 73,
      "type": "single",
      "question": "习近平总书记在中国科协第十次全国代表大会上强调立足新发展阶段、贯彻新发展理念、构建新发展格局、推动高质量发展，必须深入实施()，完善国家创新体系，加快建设科技强国，实现高水平科技自立自强。",
      "options": [
        "科教兴国战略",
        "人才强国战略",
        "创新驱动发展战略",
        "保护环境战略"
      ],
      "answer": "ABC"
    },
    {
      "id": 74,
      "type": "single",
      "question": "如何办好人民满意的教育，需做到()。",
      "options": [
        "必须深化教育领域综合改革",
        "必须促进教育公平",
        "必须建设高质量教育体系",
        "必须加强教师队伍建设"
      ],
      "answer": "ABCD"
    },
    {
      "id": 75,
      "type": "single",
      "question": "教育是国之大计、党之大计，因此推进教育现代化具有()意义。",
      "options": [
        "教育现代化是由教育大国迈向教育强国的必由之路",
        "教育现代化是提升我国国民的综合素质的重要路径",
        "教育现代化是全面实现社会主义现代化的关键支撑",
        "教育现代化是全面落实科教兴国的关键一招"
      ],
      "answer": "ABC"
    },
    {
      "id": 76,
      "type": "single",
      "question": "习近平总书记在中国共产党第二十次全国代表大会上提出要加快建设()，坚持为党育人、为国育才，全面提高人才自主培养质量，着力造就拔尖创新人才，聚天下英才而用之。",
      "options": [
        "教育强国",
        "科技强国",
        "人才强国",
        "发展强国"
      ],
      "answer": "ABC"
    },
    {
      "id": 77,
      "type": "single",
      "question": "人民民主具有完整的制度程序和完整的参与实践，()",
      "options": [
        "支撑国家制度体系和治理体系",
        "促进国家治理的高效能",
        "提升国家治理体系和治理能力现代化水平",
        "为社会主义民主政治制度不断完善注入动力",
        "为全面建设社会主义现代化国家提供坚强的制度保障"
      ],
      "answer": "ABCE"
    },
    {
      "id": 78,
      "type": "single",
      "question": "走中国特色社会主义政治发展道路，必须坚持的根本原则和核心所在\n是()的有机统一。",
      "options": [
        "坚持依法治国",
        "坚持人民民主专政",
        "坚持党的领导",
        "坚持人民当家作主",
        "坚持人民代表大会制度"
      ],
      "answer": "ACD"
    },
    {
      "id": 79,
      "type": "single",
      "question": "中国特色社会主义的政治制度是由()等组成的制度体系。",
      "options": [
        "特殊政治制度",
        "基本政治制度",
        "重要政治制度",
        "根本政治制度",
        "重点政治制度"
      ],
      "answer": "BCD"
    },
    {
      "id": 80,
      "type": "single",
      "question": "人民代表大会制度是我国的根本政治制度，这是因为()",
      "options": [
        "它直接体现我国人民民主专政的国家性质",
        "它能从根本上保证人民当家作主的权利",
        "它在制定国家其他各种制度中起着决定性的作用",
        "它能使广大人民在国家政治生活中直接行使民主权利",
        "它体现中国共产党的执政地位"
      ],
      "answer": "ABC"
    },
    {
      "id": 81,
      "type": "single",
      "question": "我国的基本政治制度有()",
      "options": [
        "中国共产党领导的多党合作和政治协商制度",
        "民族区域自治制度",
        "人民代表大会制度",
        "民主监督制度",
        "基层群众自治制度"
      ],
      "answer": "ABE"
    },
    {
      "id": 82,
      "type": "single",
      "question": "我国的社会主义民主政治制度安排()",
      "options": [
        "能够有效保证人民享有更加广泛、更加充实的权利和自由",
        "保证人民广泛参与国家治理和社会治理",
        "能够有效调节国家政治关系",
        "能够集中力量办大事，有效促进社会生产力解放和发展",
        "能够有效维护国家独立自主，有力维护国家主权、安全、发展利益"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 83,
      "type": "single",
      "question": "全过程人民民主深刻彰显了我国人民民主的鲜明特色和显著优势，实现了()相统一。",
      "options": [
        "直接民主和间接民主",
        "过程民主和成果民主",
        "形式民主和结果民主",
        "程序民主和实质民主",
        "人民民主和国家意志"
      ],
      "answer": "ABDE"
    },
    {
      "id": 84,
      "type": "single",
      "question": "加强和促进海内外中华儿女大团结，要辩证把握好()",
      "options": [
        "固守圆心和扩大共识的关系",
        "华人和华侨的关系",
        "潜绩和显绩的关系",
        "原则性和灵活性的关系",
        "团结和斗争的关系"
      ],
      "answer": "ACDE"
    },
    {
      "id": 85,
      "type": "single",
      "question": "全过程人民民主具体地、生动地体现在人民当家作主的全过程各环节，包括哪些环节()",
      "options": [
        "民主选举",
        "民主协商",
        "民主决策",
        "民主管理",
        "民主监督"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 86,
      "type": "single",
      "question": "坚持以宪法为最高法律规范，完善以宪法为核心的中国特色社会主义法律体系，加强()领域立法，把国家各项事业和各项工作纳入法制轨道。",
      "options": [
        "个别领域",
        "重点领域",
        "新兴领域",
        "涉外领域"
      ],
      "answer": "BCD"
    },
    {
      "id": 87,
      "type": "single",
      "question": "加快形成严密的法治监督体系，应该把党内监督同()等贯通起来，增强监督合力，强化监督责任，提高监督实效，做到有权必有责、有责要担当、失责必追究。",
      "options": [
        "人大监督",
        "民主监督",
        "行政监督",
        "司法监督",
        "舆论监督"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 88,
      "type": "single",
      "question": "坚持党对全面依法治国的领导，必须坚持()。",
      "options": [
        "党领导立法",
        "保证执法",
        "支持司法",
        "带头守法"
      ],
      "answer": "ABCD"
    },
    {
      "id": 89,
      "type": "single",
      "question": "加强建设法治社会，应该加强青少年法治教育，引导广大青少年做社会主义法治的()。",
      "options": [
        "忠实崇尚者",
        "自觉遵守者",
        "坚定捍卫者",
        "自由推动者"
      ],
      "answer": "ABC"
    },
    {
      "id": 90,
      "type": "single",
      "question": "全面依法治国必须正确处理()等重大关系。",
      "options": [
        "政治和法治",
        "改革和法治",
        "依法治国和以德治国",
        "依法治国和依规治党"
      ],
      "answer": "ABCD"
    },
    {
      "id": 91,
      "type": "single",
      "question": "构成中国特色社会主义法治道路的核心要义，并规定和确保着中国特色社会主义法治体系的制度属性和前进方向的是()。",
      "options": [
        "以人民为中心",
        "党的领导",
        "中国特色社会主义制度",
        "中国特色社会主义法治理论"
      ],
      "answer": "BCD"
    },
    {
      "id": 92,
      "type": "single",
      "question": "坚持法治()一体建设，全面推进科学立法、严格执法、公正司法、全民守法，全面推进国家各方面工作法治化。",
      "options": [
        "法治国家",
        "法治社会",
        "法治政府",
        "法治环境"
      ],
      "answer": "ABC"
    },
    {
      "id": 96,
      "type": "single",
      "question": "为什么建设中国特色社会主义文化？以下正确的是()。",
      "options": [
        "文化兴国运兴，文化强民族强",
        "文化是一个国家、一个民族的灵魂",
        "没有文化繁荣兴盛就没有中华民族伟大复兴",
        "更好满足人民日益增长的精神文化需要"
      ],
      "answer": "ABCD"
    },
    {
      "id": 97,
      "type": "single",
      "question": "要化解人与自然、人与人、人与社会的各种矛盾，必须依靠文化的()作用。",
      "options": [
        "熏陶",
        "教化",
        "激励",
        "基础"
      ],
      "answer": "ABC"
    },
    {
      "id": 98,
      "type": "single",
      "question": "互联网是意识形态工作的()，管好用好互联网是新形势下做好新闻舆论工作的关键。",
      "options": [
        "主阵地",
        "主战场",
        "最难处",
        "最前沿"
      ],
      "answer": "ABD"
    },
    {
      "id": 104,
      "type": "single",
      "question": "加强和创新社会治理的措施包括()。",
      "options": [
        "创新社会治理体制",
        "改进社会治理方式",
        "加强社会心理服务体系建设",
        "加强社区治理体系建设"
      ],
      "answer": "ABCD"
    },
    {
      "id": 105,
      "type": "single",
      "question": "我国提高和改善民生的路径包括()。",
      "options": [
        "优先发展教育事业",
        "抓好就业工作",
        "促进收入分配更合理、更有序",
        "加强社会保障体系建设"
      ],
      "answer": "ABCD"
    },
    {
      "id": 111,
      "type": "single",
      "question": "大自然是人类赖以生存发展的基本条件，()是全面建设社会主义现代化国家的内在要求。",
      "options": [
        "尊重自然",
        "顺应自然",
        "保护自然",
        "战胜自然"
      ],
      "answer": "ABC"
    },
    {
      "id": 112,
      "type": "single",
      "question": "推动消费方式绿色转型，倡导简约适度、绿色低碳的生活方式，是每一个公民的责任。以下属于绿色低碳生活方式的有()。",
      "options": [
        "分类投放垃圾",
        "超市购物自带环保布袋",
        "近距离出行时，使用共享单车",
        "选用节能电器，随手关灯"
      ],
      "answer": "ABCD"
    },
    {
      "id": 113,
      "type": "single",
      "question": "关于加快生态文明体制改革，下列说法正确的是()。",
      "options": [
        "推进绿色发展",
        "着力解决突出环境问题",
        "加大生态保护力度",
        "改善生态环境监管体制"
      ],
      "answer": "ABCD"
    },
    {
      "id": 114,
      "type": "single",
      "question": "我们要推进美丽中国建设，坚持山水林田湖草沙一体化保护和系统治理，统筹()、应对气候变化，协同推进降碳、减污、扩绿、增长，推进生态优先、节约集约、绿色低碳发展。",
      "options": [
        "产业结构调整",
        "污染治理",
        "生态保护",
        "经济增长"
      ],
      "answer": "ABC"
    },
    {
      "id": 115,
      "type": "single",
      "question": "我们要深入推进环境污染防治，持续深入打好()保卫战，基本消除重污染天气，基本消除城市黑臭水体，加强土壤污染源头防控，提升环境基础设施建设水平，推进城乡人居环境整治。",
      "options": [
        "绿地",
        "蓝天",
        "碧水",
        "净土"
      ],
      "answer": "BCD"
    },
    {
      "id": 116,
      "type": "single",
      "question": "为什么建设生态文明，以下说法正确的是()。",
      "options": [
        "顺应人类文明进程",
        "破解我国经济社会发展短板问题",
        "满足人民日益增长的优美生态环境需要",
        "应对全球生态环境领域挑战"
      ],
      "answer": "ABCD"
    },
    {
      "id": 117,
      "type": "single",
      "question": "过去一段时期，我国生态退化比较严重，致使我国经济社会发展的环境承载力下降。要破解这一短板问题，必须()。",
      "options": [
        "加快构建生态功能保障基线",
        "提升生态系统稳定性",
        "加快发展经济",
        "提升生态系统质量"
      ],
      "answer": "ABD"
    },
    {
      "id": 118,
      "type": "single",
      "question": "当代生态环境恶化的影响日益扩大，人为造成的生态环境问题日益严重，并迅速由发达国家向发展中国家蔓延，对生态安全等造成威胁。()等严峻状况，威胁着整个人类社会的生存和发展。",
      "options": [
        "气候变化",
        "海洋污染",
        "臭氧空洞",
        "生化污染"
      ],
      "answer": "ABCD"
    },
    {
      "id": 119,
      "type": "single",
      "question": "积极参与气候变化等全球环境治理，具有重要意义，以下表述正确的是()。",
      "options": [
        "是我国生态文明建设的有机组成部分",
        "推动国际社会共同构建人与自然命运共同体",
        "展现我国作为负责任发展中大国的担当和影响力",
        "化解全球生态环境问题给中华民族永续发展带来的风险"
      ],
      "answer": "ABCD"
    },
    {
      "id": 120,
      "type": "single",
      "question": "10.2014年3月7日，习近平在参加十二届全国人大二次会议贵州代表团审议时说，既要绿水青山，也要金山银山；绿水青山就是金山银山。绿水青山是()。",
      "options": [
        "自然财富",
        "生态财富",
        "社会财富",
        "经济财富"
      ],
      "answer": "ABCD"
    },
    {
      "id": 121,
      "type": "single",
      "question": "总体国家安全观()",
      "options": [
        "以人民安全为宗旨",
        "以经济安全为根本",
        "以政治安全为根本",
        "以军事、文化、社会安全为保障",
        "以促进国际安全为依托"
      ],
      "answer": "ACDE"
    },
    {
      "id": 122,
      "type": "single",
      "question": "国家安全能力建设具有()意义。",
      "options": [
        "基础性",
        "长效性",
        "时代性",
        "长期性",
        "根本性"
      ],
      "answer": "ADE"
    },
    {
      "id": 123,
      "type": "single",
      "question": "建设更高水平的平安中国包括()",
      "options": [
        "治理效能更强",
        "安全稳定局面更巩固",
        "安全体系更完全",
        "人民更满意",
        "智能化水平更高"
      ],
      "answer": "ABD"
    },
    {
      "id": 124,
      "type": "single",
      "question": "中国特色国家安全道路的重要特征有()",
      "options": [
        "坚持党的绝对领导，完善集中统一、高效权威的国家安全工作体制，\n实现人民安全、政治安全、国家利益至上相统一",
        "坚持捍卫国家主权和领土完整，维护边疆、边境、周边安定有序",
        "坚持安全发展，推动高质量发展和高水平安全动态平衡",
        "坚持总体战，统筹传统安全和非传统安全",
        "坚持走和平发展道路，促进自身安全和共同安全相协调"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 125,
      "type": "single",
      "question": "总体国家安全观强调做好国家安全工作的系统思维和方法，统筹()",
      "options": [
        "外部安全和内部安全",
        "国土安全和国民安全",
        "传统安全和非传统安全",
        "自身安全和共同安全",
        "国家安全和社会安全"
      ],
      "answer": "ABCD"
    },
    {
      "id": 126,
      "type": "single",
      "question": "总体国家安全观具有重大而深远的意义，主要有()",
      "options": [
        "为发展马克思主义国家安全理论作出了重大原创性贡献",
        "为维护和塑造新时代国家安全提供了行动纲领",
        "为推动和完善全球安全治理贡献了中国方案",
        "为坚持把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合树立了光辉典范",
        "为推动人类命运共同体提供了安全实践方案"
      ],
      "answer": "ABCD"
    },
    {
      "id": 127,
      "type": "single",
      "question": "维护网络安全()",
      "options": [
        "要加速推动信息领域核心技术突破",
        "要加强关键信息基础设施网络安全防护",
        "要加强网络安全预警监测",
        "要依法加强网络空间治理",
        "要切实维护国家网络空间主权安全，共同构建网络空间命运共同体"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 128,
      "type": "single",
      "question": "()是保障国家安全的治本之策，是维护和塑造国家安全的重要支撑。",
      "options": [
        "健全国家安全体系",
        "推进国家安全体系和能力现代化",
        "构建安全防护体系",
        "加强国家安全制度建设",
        "增强维护国家安全能力"
      ],
      "answer": "AD"
    },
    {
      "id": 129,
      "type": "single",
      "question": "提高和防范化解重大风险能力过程中，要坚持()",
      "options": [
        "系统思维",
        "政治思维",
        "底线思维",
        "全局思维",
        "极限思维"
      ],
      "answer": "CE"
    },
    {
      "id": 130,
      "type": "single",
      "question": "以下判断正确的是()",
      "options": [
        "军民融合发展是兴国之举",
        "我国的军民融合发展已经进入深度融合阶段",
        "军民融合是强军之策",
        "军民融合的目标是实现富国和强军的统一",
        "军民融合有助于实现经济建设和国防建设的综合效益最大化"
      ],
      "answer": "ACDE"
    },
    {
      "id": 131,
      "type": "single",
      "question": "基本实现国防和军队现代化的关键是实现()",
      "options": [
        "军事理论现代化",
        "军队组织形态现代化",
        "国防科技现代化",
        "军事人员现代化",
        "武器装备现代化"
      ],
      "answer": "ABDE"
    },
    {
      "id": 132,
      "type": "single",
      "question": "以下判断错误的是()",
      "options": [
        "到2020年，我国基本实现国防和军队现代化",
        "到2035年，我国基本实现国防和军队现代化",
        "到21世纪中叶，人民军队建成世界一流军队",
        "到2035年，人民军队建成世界一流军队",
        "到2020年，国防和军队建设基本实现机械化"
      ],
      "answer": "AD"
    },
    {
      "id": 133,
      "type": "single",
      "question": "21世纪中叶把人民军队全面建成世界一流军队的具体目标有()",
      "options": [
        "建成同我国强国地位相称的世界一流军队",
        "建成具有强大军事作战能力的世界一流军队",
        "建成具有国际威慑力的世界一流军队",
        "建成能够全面有效维护国家安全的世界一流军队",
        "建成具备强大国际影响力的世界一流军队"
      ],
      "answer": "ADE"
    },
    {
      "id": 134,
      "type": "single",
      "question": "巩固提高一体化国家战略体系和能力，关键要在一体化上下功夫。坚持党中央集中统一领导，加强各领域()。",
      "options": [
        "战略布局一体融合",
        "战略资源一体整合",
        "战略政策一体衔接",
        "战略力量一体运用",
        "战略规划一体统筹"
      ],
      "answer": "ABD"
    },
    {
      "id": 135,
      "type": "single",
      "question": "在枪林弹雨的战场上，面对气焰嚣张的强大敌人，人民军队发出了英雄宣言：在革命战士面前，()",
      "options": [
        "不相信有无畏的牺牲",
        "不相信有完不成的任务",
        "不相信有克服不了的困难",
        "不相信有战胜不了的敌人",
        "不相信有实现不了的目标"
      ],
      "answer": "BCD"
    },
    {
      "id": 136,
      "type": "single",
      "question": "党的十九大明确提出，党在新时代的强军目标是建设一支()的人民军队。",
      "options": [
        "听党指挥",
        "为人民服务",
        "能打胜仗",
        "作风优良",
        "战之必胜"
      ],
      "answer": "ACD"
    },
    {
      "id": 137,
      "type": "single",
      "question": "坚持我党对军队的绝对领导不是抽象的，而是有一整套制度作为保障的，这些制度包含()",
      "options": [
        "中央军委实行主席和副主席负责制",
        "军队的最高领导权和指挥权属于党中央和中央军委",
        "实行党委制、政治委员制、政治机关制",
        "实行支部建在连上",
        "实行党委统一的集体领导下的首长分工负责制"
      ],
      "answer": "BCDE"
    },
    {
      "id": 138,
      "type": "single",
      "question": "新时代人民军队的使命任务是()",
      "options": [
        "为巩固中国共产党领导和我国社会主义制度提供战略支持",
        "为捍卫国家主权、统一、领土完整提供战略支撑",
        "为维护我国海外利益提供战略支撑",
        "为保障社会主义全面现代化建设提供战略支撑",
        "为促进世界和平与发展提供战略支撑"
      ],
      "answer": "ABCE"
    },
    {
      "id": 139,
      "type": "single",
      "question": "“爱国者治港”“爱国者治澳”原则要求爱国者必须真心维护()，尊重和维护宪法和基本法确定的宪制秩序，维护香港、澳门的繁荣稳定。",
      "options": [
        "合法权益",
        "国家主权",
        "安全",
        "发展利益"
      ],
      "answer": "BCD"
    },
    {
      "id": 140,
      "type": "single",
      "question": "中央对香港特别行政区拥有的全面管治权，包括()。",
      "options": [
        "行政长官和主要官员任命权",
        "基本法解释权和修改权",
        "中央政府向行政长官发出指令权",
        "中央对特别行政区法律备案权"
      ],
      "answer": "ABCD"
    },
    {
      "id": 141,
      "type": "single",
      "question": "“一国两制”是一个完整的概念，二者之间的关系是()。",
      "options": [
        "“一国”是实行“两制”的前提和基础",
        "“两制”从属和派生于“一国”",
        "“两制”统一于“一国”之内",
        "“一国”是根，根深才能叶茂；“一国”是本，本固才能枝荣"
      ],
      "answer": "ABCD"
    },
    {
      "id": 142,
      "type": "single",
      "question": "习近平总书记在庆祝香港回归祖国25周年大会暨香港特别行政区第六届政府就职典礼上指出，中央全力支持香港抓住国家发展带来的历史机遇，主动对接()等国家战略。",
      "options": [
        "“十四五”规划",
        "粤港澳大湾区建设",
        "“一带一路”高质量发展",
        "自由贸易试验区建设"
      ],
      "answer": "ABC"
    },
    {
      "id": 143,
      "type": "single",
      "question": "中央依据()对香港特别行政区拥有全面管治权。",
      "options": [
        "民法",
        "刑法",
        "宪法",
        "基本法"
      ],
      "answer": "CD"
    },
    {
      "id": 144,
      "type": "single",
      "question": "香港特别行政区拥有的高度自治权包括()。",
      "options": [
        "行政管理权",
        "外交权",
        "立法权",
        "独立的司法权和终审权"
      ],
      "answer": "ACD"
    },
    {
      "id": 145,
      "type": "single",
      "question": "粤港澳大湾区是在()的条件下建设的，国际上没有先例，需要大胆闯、大胆试，开出一条新路来。",
      "options": [
        "一个国家",
        "两种制度",
        "三个关税区",
        "三种货币"
      ],
      "answer": "ABCD"
    },
    {
      "id": 146,
      "type": "single",
      "question": "2005年颁布实施的《反分裂国家法》明确指出()。",
      "options": [
        "世界上只有一个中国",
        "中央对香港、澳门拥有全面管治权",
        "大陆和台湾同属一个中国",
        "中国的主权和领土完整不容分割"
      ],
      "answer": "ACD"
    },
    {
      "id": 147,
      "type": "single",
      "question": "人类是一个整体，地球是一个家园。面对共同挑战，任何人任何国家都无法独善其身，人类只有和衷共济，和合共生这一条出路。政党作为推动人类进步的重要力量，要锚定正确的前进方向，担起为人民谋幸福、为人类谋进步的历史责任。为此，我们党应努力做到()。",
      "options": [
        "我们要担负起引领方向的责任，把握和塑造人类共同未来",
        "我们要担负起凝聚共识的责任，坚守和弘扬全人类共同价值",
        "我们要担负起促进发展的责任，让发展成果更多更公平地惠及各国人民",
        "我们要担负起加强合作的责任，携手应对全球性风险和挑战",
        "我们要担负起完善治理的责任，不断增强为人民谋幸福的能力"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 148,
      "type": "single",
      "question": "人类命运共同体要建设共同繁荣的世界，就要坚持你好我好大家好的理念，推进()的经济全球化，创造全人类共同发展的良好条件，共同推动世界各国发展繁荣，让发展成果惠及世界各国。",
      "options": [
        "开放",
        "包容",
        "普惠",
        "平衡",
        "共赢"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 149,
      "type": "single",
      "question": "2023年3月，习近平在中国共产党与世界政党高层对话会上提出全球文明倡议。全球文明倡议，()",
      "options": [
        "倡导尊重世界文明多样性",
        "倡导弘扬全人类共同价值",
        "倡导以和平方式解决国家间分歧和争端",
        "倡导重视文明传承和创新",
        "倡导加强国际人文交流合作"
      ],
      "answer": "ABDE"
    },
    {
      "id": 150,
      "type": "single",
      "question": "摆在我们面前的时代之问有()。",
      "options": [
        "世界向何处去",
        "和平还是战争",
        "发展还是衰退",
        "开放还是封闭",
        "合作还是对抗"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 151,
      "type": "single",
      "question": "全球发展倡议，倡导各国坚持发展优先，()共同推动全球发展迈向平衡协调包容新阶段。",
      "options": [
        "坚持以人民为中心",
        "坚持普惠包容",
        "坚持创新驱动",
        "坚持人与自然和谐共生",
        "坚持行动导向"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 152,
      "type": "single",
      "question": "人类命运共同体要建设普遍安全的世界，就要树立()的安全观。",
      "options": [
        "共同",
        "综合",
        "合作",
        "全面",
        "可持续"
      ],
      "answer": "ABCE"
    },
    {
      "id": 153,
      "type": "single",
      "question": "当前，世界百年未有之大变局加速演进，和平发展进步力量不断增长。我们应顺应历史大势，()坚决反对一切形式的霸权主义和强权政治，坚决反对一切形式的单边主义和保护主义。",
      "options": [
        "坚持合作，不搞对抗",
        "坚持开放，不搞封闭",
        "坚持全面，不搞局部",
        "坚持互利共赢、不搞零和博弈",
        "坚持互商互建，不搞小团体主义"
      ],
      "answer": "ABD"
    },
    {
      "id": 154,
      "type": "single",
      "question": "长期存在的“四种危险”是：()",
      "options": [
        "精神懈怠危险",
        "能力不足危险",
        "脱离群众危险",
        "消极腐败危险",
        "和平演变危险"
      ],
      "answer": "ABCD"
    },
    {
      "id": 155,
      "type": "single",
      "question": "坚持新时代党的组织路线。全党必须增强党组织的()功能，培养和选拔党和人民需要的好干部，培养和造就大批堪当时代重任的社会主义事业接班人，聚天下英才而用之，从组织上保证党的基本理论、基本路线、基本方略的贯彻落实。",
      "options": [
        "政治功能",
        "文化功能",
        "组织功能",
        "凝聚功能",
        "教育功能"
      ],
      "answer": "AC"
    },
    {
      "id": 156,
      "type": "single",
      "question": "新时代好干部标准是：()",
      "options": [
        "信念坚定",
        "为民服务",
        "勤政务实",
        "敢于担当",
        "清正廉洁"
      ],
      "answer": "ABCDE"
    },
    {
      "id": 157,
      "type": "single",
      "question": "全面从严治党实践形成了一系列重要经验，包括：()",
      "options": [
        "坚持思想建党和制度治党相统一",
        "坚持使命引领和问题导向相统一",
        "坚持抓“关键少数”和管“大多数”相统一",
        "坚持严格管理和关心信任相统一",
        "坚持党内监督和群众监督相统一",
        "坚持行使权力和担当责任相统一"
      ],
      "answer": "ABCDEF"
    },
    {
      "id": 158,
      "type": "single",
      "question": "落实新时代党的建设总要求，健全全面从严治党体系，全面推进党的()",
      "options": [
        "自我净化",
        "自我完善",
        "自我革新",
        "自我提高",
        "自我革命"
      ],
      "answer": "ABCD"
    },
    {
      "id": 159,
      "type": "single",
      "question": "习近平总书记提出的“三个务必”指的是：()",
      "options": [
        "务必不忘初心、牢记使命",
        "务必谦虚谨慎、艰苦奋斗",
        "务必敢于斗争、善于斗争",
        "务必勤奋学习、善于学习"
      ],
      "answer": "ABC"
    }
  ]

interface Question {
    id: number;
    type: string;
    question: string;
    options: string[];
    answer: string;
}

// 随机抽取指定数量的题目
function getRandomQuestions(questions: Question[], count: number): Question[] {
    const shuffled = questions.sort(() => 0.5 - Math.random());
    return shuffled.slice(0, count);
}

export async function GET(request: Request) {
    try {

        console.log(`当前时间：${new Date().toLocaleString()} - 用户获取题目`)
        const { searchParams } = new URL(request.url);
        // 获取参数，如果没有则使用默认值20
        const singleCount = Number(searchParams.get('singleCount')) || 20;
        const multipleCount = Number(searchParams.get('multipleCount')) || 20;

        // 随机抽取20道单选题和20道多选题
        const selectedSingle = getRandomQuestions(singleChoice, singleCount);
        const selectedMultiple = getRandomQuestions(multipleChoice, multipleCount);

        // 返回数据，包含分数信息
        return NextResponse.json({
            success: true,
            data: {
                singleChoice: {
                    questions: selectedSingle,
                    totalScore: 40  // 单选题总分
                },
                multipleChoice: {
                    questions: selectedMultiple,
                    totalScore: 60  // 多选题总分
                }
            }
        });

    } catch (error) {
        console.error('Error reading question files:', error);
        return NextResponse.json({
            success: false,
            message: '获取题目失败'
        }, { status: 500 });
    }
}